----------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/Noel Johnson Notebook/Desktop/Dropbox/Research/Jews City Growt
> h/Replication Files JDE Johnson_Koyama/Jews City Growth Analysis Final.log
  log type:  text
 opened on:  30 Aug 2016, 20:54:03

. 
. 
. ************************************************
. ************************************************
. * This is the analysis using D-in-D specifications and 1400-1850 sample *
. ************************************************
. ************************************************
. 
. 
. ************************************************
. * Clean up the data set *
. ************************************************
. 
. sort Bairoch_id year

. 
. * Drop the 5 cities that are in the middle of nowhere (and out of frame in the g
> is file) *
. 
. * Bergen
. drop if Bairoch_id==1648
(0 observations deleted)

. *Trondheim
. drop if Bairoch_id==1656
(0 observations deleted)

. *Ponta-Delgada
. drop if Bairoch_id==1805
(0 observations deleted)

. *Falun
. drop if Bairoch_id==2078
(0 observations deleted)

. *Gaevle
. drop if Bairoch_id==2079
(0 observations deleted)

. 
. xtset Bairoch_id year
       panel variable:  Bairoch_id (strongly balanced)
        time variable:  year, 800 to 1850, but with gaps
                delta:  1 unit

. 
. 
. *************************************************
. * Create Some Variables *
. *************************************************
. 
. by Bairoch_id: egen meanjewspresentdummy=mean(jewspresentDummy)

. gen JewishCity=0

. replace JewishCity=1 if  meanjewspresentdummy>0
(6513 real changes made)

. label var JewishCity "=1 if city ever has a Jewish community"

. drop  meanjewspresentdummy

. 
. sort Bairoch_id year

. by Bairoch_id: gen lag1pop=pop[_n-1]
(15618 missing values generated)

. gen lngrowth= ln(pop/lag1pop)
(15738 missing values generated)

. gen  lag1lnpop =ln(lag1pop)
(15622 missing values generated)

. 
. sort Bairoch_id year

. gen altpop=pop
(13923 missing values generated)

. replace altpop=.5 if pop==.
(13923 real changes made)

. replace altpop=.5 if pop==0
(4 real changes made)

. 
. gen lpop=ln(pop)
(13927 missing values generated)

. gen lnpopB = ln(pop_bairoch)
(13946 missing values generated)

. 
. 
. 
. drop if year<1400
(10752 observations deleted)

. 
. ************************************************************************
. *create sample variables to hold constant the city samples over time
. ************************************************************************
. 
. 
. sort  Bairoch_id year

. gen growthexist1400=.
(12544 missing values generated)

. replace growthexist1400=1 if (lpop~=. & year==1400)
(572 real changes made)

. replace growthexist1400=1 if (lpop~=. & year==1500)
(768 real changes made)

. replace growthexist1400=1 if (lpop~=. & year==1600)
(1033 real changes made)

. replace growthexist1400=1 if (lpop~=. & year==1700)
(1272 real changes made)

. replace growthexist1400=1 if (lpop~=. & year==1750)
(1357 real changes made)

. replace growthexist1400=1 if (lpop~=. & year==1800)
(1743 real changes made)

. replace growthexist1400=1 if (lpop~=. & year==1850)
(1695 real changes made)

. by Bairoch_id: egen temp=sum(growthexist1400)

. replace growthexist1400=1 if temp==7
(0 real changes made)

. replace growthexist1400=0 if temp<7 
(8694 real changes made)

. drop temp

. 
. sort  Bairoch_id year

. gen growthexist1500=.
(12544 missing values generated)

. replace growthexist1500=1 if (lpop~=. & year==1500)
(768 real changes made)

. replace growthexist1500=1 if (lpop~=. & year==1600)
(1033 real changes made)

. replace growthexist1500=1 if (lpop~=. & year==1700)
(1272 real changes made)

. replace growthexist1500=1 if (lpop~=. & year==1750)
(1357 real changes made)

. replace growthexist1500=1 if (lpop~=. & year==1800)
(1743 real changes made)

. replace growthexist1500=1 if (lpop~=. & year==1850)
(1695 real changes made)

. by Bairoch_id: egen temp=sum(growthexist1500)

. replace growthexist1500=1 if temp==6
(742 real changes made)

. replace growthexist1500=0 if temp<6 
(7350 real changes made)

. drop temp

. 
. 
. sort  Bairoch_id year

. gen growthexist1600=.
(12544 missing values generated)

. replace growthexist1600=1 if (lpop~=. & year==1600)
(1033 real changes made)

. replace growthexist1600=1 if (lpop~=. & year==1700)
(1272 real changes made)

. replace growthexist1600=1 if (lpop~=. & year==1750)
(1357 real changes made)

. replace growthexist1600=1 if (lpop~=. & year==1800)
(1743 real changes made)

. replace growthexist1600=1 if (lpop~=. & year==1850)
(1695 real changes made)

. by Bairoch_id: egen temp=sum(growthexist1600)

. replace growthexist1600=1 if temp==5
(1992 real changes made)

. replace growthexist1600=0 if temp<5 
(5572 real changes made)

. drop temp

. 
. 
. sort  Bairoch_id year

. gen growthexist1700=.
(12544 missing values generated)

. replace growthexist1700=1 if (lpop~=. & year==1700)
(1272 real changes made)

. replace growthexist1700=1 if (lpop~=. & year==1750)
(1357 real changes made)

. replace growthexist1700=1 if (lpop~=. & year==1800)
(1743 real changes made)

. replace growthexist1700=1 if (lpop~=. & year==1850)
(1695 real changes made)

. by Bairoch_id: egen temp=sum(growthexist1700)

. replace growthexist1700=1 if temp==4
(3681 real changes made)

. replace growthexist1700=0 if temp<4 
(3955 real changes made)

. drop temp

. 
. 
. ************************************************************************
. *import the instruments
. ************************************************************************
. 
. *expulsion iv
. sort  Bairoch_id year

. merge m:m Bairoch_id year using "/Users/Noel Johnson Notebook/Desktop/Dropbox/Re
> search/Jews City Growth/Replication Files JDE Johnson_Koyama/IV/jewishcityivs_Co
> 1_Expulsion.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        10,806
        from master                         0  (_merge==1)
        from using                     10,806  (_merge==2)

    matched                            12,544  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. rename NA1_1 IV0k_exp

. rename NA1_9 IV50k_exp

. rename NA1_3 IV100k_exp

. rename NA1_4 IV250k_exp

. rename NA1_8 IV500k_exp

. rename NA1_7 IV_MA

. 
. 
. gen lnIV0k_exp = ln(IV0k_exp)
(7177 missing values generated)

. gen lnIV50k_exp = ln(IV50k_exp)
(7177 missing values generated)

. gen lnIV100k_exp = ln(IV100k_exp)
(7177 missing values generated)

. gen lnIV250k_exp = ln(IV250k_exp)
(7177 missing values generated)

. gen lnIV500k_exp = ln(IV500k_exp)
(7177 missing values generated)

. gen lnIV_MA=ln(IV_MA)
(7177 missing values generated)

. 
. drop if year<1400
(10764 observations deleted)

. 
. 
. 
. *non-expulsion iv
. sort  Bairoch_id year

. merge m:m Bairoch_id year using "/Users/Noel Johnson Notebook/Desktop/Dropbox/Re
> search/Jews City Growth/Replication Files JDE Johnson_Koyama/IV/jewishcityivs_Co
> 1.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                        10,764
        from master                         0  (_merge==1)
        from using                     10,764  (_merge==2)

    matched                            12,586  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. rename NA1_1 IV0k

. rename NA1_9 IV50k

. rename NA1_3 IV100k

. rename NA1_4 IV250k

. rename NA1_8 IV500k

. drop NA1_7

. 
. gen lnIV0k = ln(IV0k)
(7177 missing values generated)

. gen lnIV50k = ln(IV50k)
(7177 missing values generated)

. gen lnIV100k = ln(IV100k)
(7177 missing values generated)

. gen lnIV250k = ln(IV250k)
(7177 missing values generated)

. gen lnIV500k = ln(IV500k)
(7177 missing values generated)

. 
. drop if year<1400
(10764 observations deleted)

. 
. 
. 
. ************************************************************************
. *import imputed black death mortality rates
. ************************************************************************
. 
. drop  pmort185

. sort Bairoch_id year

. merge m:1 Bairoch_id using "/Users/Noel Johnson Notebook/Desktop/Dropbox/Researc
> h/Jews City Growth/Replication Files JDE Johnson_Koyama/Data Sets/FinalMortality
> Data.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            42
        from master                        42  (_merge==1)
        from using                          0  (_merge==2)

    matched                            12,544  (_merge==3)
    -----------------------------------------

. *Drop Alexandria, Ceuta, Tunis, et al...
. drop if _merge==1
(42 observations deleted)

. drop _merge

. 
. 
. ************************************************************************
. *Fix 1850 coding mistakes (due to RA miscommunication)
. ************************************************************************
. 
. 
. replace jewspresentDummy=1 if city_jjk=="HALBERSTADT" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="HEIDELBERG" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="SCHWERIN" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="WISMAR" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="ROVIGO" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="LUENENBERG" & year==1850
(0 real changes made)

. replace jewspresentDummy=1 if city_jjk=="OLDENBERG" & year==1850
(0 real changes made)

. replace jewspresentDummy=1 if city_jjk=="PASSAU" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="LUGO" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="NARBONNE" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="IPSWICH" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="SUNDERLAND" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="PITIGLIANO" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="GUESTROW" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="ROSTOCK" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="ALKMAAR" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="AMERSFOORT" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="GRONINGEN" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="HAARLEM" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="LEEUWARDEN" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="ROTTERDAM" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="SGRAVENHAGUE" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="WORKUM" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="ZWOLLE" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="NYSA" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="WARSZAWA" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="OSTRAVA" & year==1850
(1 real change made)

. 
. 
. 
. order  city_jjk Bairoch_id year JewishCity jewspresentDummy jewspresentYears per
> secutions expulsion pogrom lpop lngrowth    pop_bairoch pop countryname

. 
. 
. *************************************************
. ** Summary Statistics ***************************
. *************************************************
. 
. **************************
. * Figure A.8 Main Sample Histogram *
. *************************
. 
. sort year

. by year: count if JewishCity==1  & lpop~=.

----------------------------------------------------------------------------------
-> year = 1400
  286
----------------------------------------------------------------------------------
-> year = 1500
  353
----------------------------------------------------------------------------------
-> year = 1600
  400
----------------------------------------------------------------------------------
-> year = 1700
  432
----------------------------------------------------------------------------------
-> year = 1750
  449
----------------------------------------------------------------------------------
-> year = 1800
  496
----------------------------------------------------------------------------------
-> year = 1850
  482

. 
. graph bar (mean)  jewspresentDummy if JewishCity==1 & lpop~=., over(year)

. 
. 
. **************************
. * Table A.3 Main Sample Stats *
. *************************
. 
. xtsum jewspresentDummy lpop cereal50k university DAnySeas DRivers DMedRds lnIV10
> 0k lnIV100k_exp lnIV_MA if JewishCity==1 & lpop~=.

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
jewspr~y overall |  .5127674   .4999232          0          1 |     N =    2898
         between |             .3541913          0          1 |     n =     501
         within  |             .3705829  -.3443754    1.36991 | T-bar = 5.78443
                 |                                            |
lpop     overall |  2.326069   1.060052          0   7.712444 |     N =    2898
         between |             .8371366   .6931472   6.080888 |     n =     501
         within  |             .6105844  -1.011015   5.601595 | T-bar = 5.78443
                 |                                            |
cere~50k overall |  4.603533   .6931208   2.206897   7.229167 |     N =    2898
         between |             .7073488   2.206897   7.229167 |     n =     501
         within  |                    0   4.603533   4.603533 | T-bar = 5.78443
                 |                                            |
univer~y overall |  .0565908   .2310988          0          1 |     N =    2898
         between |              .213777          0          1 |     n =     501
         within  |                    0   .0565908   .0565908 | T-bar = 5.78443
                 |                                            |
DAnySeas overall |  155625.6   141886.3   59.27785   595701.6 |     N =    2898
         between |               142704   59.27785   595701.6 |     n =     501
         within  |                    0   155625.6   155625.6 | T-bar = 5.78443
                 |                                            |
DRivers  overall |  43207.66   63046.33   13.90545   424386.9 |     N =    2898
         between |             62416.76   13.90545   424386.9 |     n =     501
         within  |                    0   43207.66   43207.66 | T-bar = 5.78443
                 |                                            |
DMedRds  overall |  61806.81   87412.81          0   587681.3 |     N =    2898
         between |             87291.18          0   587681.3 |     n =     501
         within  |                    0   61806.81   61806.81 | T-bar = 5.78443
                 |                                            |
lnIV100k overall |  2.564789   .3475631   1.544984   3.965279 |     N =    2898
         between |             .2407785   1.769223   3.361853 |     n =     501
         within  |             .2548653   2.044283   3.260309 | T-bar = 5.78443
                 |                                            |
lnIV10~p overall | -.1367952   1.674243  -3.708967    3.12836 |     N =    2898
         between |             .7032697  -2.314129   1.846383 |     n =     501
         within  |             1.585774  -3.857035   2.804551 | T-bar = 5.78443
                 |                                            |
lnIV_MA  overall |  6.760998   .6861903   4.848538   9.571323 |     N =    2898
         between |             .4733557   5.752997   9.029807 |     n =     501
         within  |             .5593701   5.543598   8.042022 | T-bar = 5.78443

. 
. 
. **************************
. * Figure A.9 Main Sample Histogram *
. *************************
. 
. 
. sort year

. by year: count if lpop~=.

----------------------------------------------------------------------------------
-> year = 1400
  572
----------------------------------------------------------------------------------
-> year = 1500
  768
----------------------------------------------------------------------------------
-> year = 1600
 1033
----------------------------------------------------------------------------------
-> year = 1700
 1272
----------------------------------------------------------------------------------
-> year = 1750
 1357
----------------------------------------------------------------------------------
-> year = 1800
 1743
----------------------------------------------------------------------------------
-> year = 1850
 1695

. 
. graph bar (mean)  jewspresentDummy if  lpop~=., over(year)

. 
. **************************
. * Table A.4 Extended Sample Stats *
. *************************
. 
. xtsum jewspresentDummy lpop cereal50k university DAnySeas DRivers DMedRds lnIV_M
> A if lpop~=.

Variable         |      Mean   Std. Dev.       Min        Max |    Observations
-----------------+--------------------------------------------+----------------
jewspr~y overall |  .1760664   .3808992          0          1 |     N =    8440
         between |             .2984941          0          1 |     n =    1791
         within  |             .2171272  -.6810765   1.033209 | T-bar = 4.71245
                 |                                            |
lpop     overall |   1.94619     .90446          0   7.712444 |     N =    8440
         between |             .6477614          0   6.080888 |     n =    1791
         within  |             .5491849  -1.390894   5.221716 | T-bar = 4.71245
                 |                                            |
cere~50k overall |   4.61671   .7978876   1.826087   7.666667 |     N =    8440
         between |             .8115572   1.826087   7.666667 |     n =    1791
         within  |                    0    4.61671    4.61671 | T-bar = 4.71245
                 |                                            |
univer~y overall |  .0194313   .1380433          0          1 |     N =    8440
         between |             .1150137          0          1 |     n =    1791
         within  |                    0   .0194313   .0194313 | T-bar = 4.71245
                 |                                            |
DAnySeas overall |  114603.8   128064.5          0   625888.1 |     N =    8440
         between |             125425.4          0   625888.1 |     n =    1791
         within  |                    0   114603.8   114603.8 | T-bar = 4.71245
                 |                                            |
DRivers  overall |  76661.34   105268.9   13.90545   459098.5 |     N =    8440
         between |             98839.89   13.90545   459098.5 |     n =    1791
         within  |                    0   76661.34   76661.34 | T-bar = 4.71245
                 |                                            |
DMedRds  overall |  104706.5     139548          0   607741.8 |     N =    8440
         between |               133667          0   607741.8 |     n =    1791
         within  |                    0   104706.5   104706.5 | T-bar = 4.71245
                 |                                            |
lnIV_MA  overall |  6.918485   .6762469   4.848538   9.571323 |     N =    8440
         between |             .4833272   5.301613   9.029807 |     n =    1791
         within  |              .515232   5.701086   8.433955 | T-bar = 4.71245

. 
. 
. **************************************************************
. * Figure A.5: conditional relevance of instrument (IV100k vs jewishdummy)  *
. **************************************************************
. 
. xi: quietly: reg jewspresentDummy i.year i.year*cereal50k i.year*university   i.
> year*DAnySeas  i.year*DRivers i.year*DMedRds  i.Bairoch_id if JewishCity==1,
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
i.Bairoch_id      _IBairoch_i_1-2151  (naturally coded; _IBairoch_i_1 omitted)

. predict jewsresid,r

. 
. xi: quietly: reg lnIV100k i.year i.year*cereal50k i.year*university   i.year*DAn
> ySeas  i.year*DRivers i.year*DMedRds   i.Bairoch_id  if JewishCity==1,
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
i.Bairoch_id      _IBairoch_i_1-2151  (naturally coded; _IBairoch_i_1 omitted)

. predict lnIV100kresid,r

. 
. lpoly lnIV100kresid jewsresid   if JewishCity==1 ,noscat ci

. 
. drop lnIV100kresid

. 
. **************************************************************
. * Figure A.6: conditional relevance of instrument (IV100k_exp vs jewishdummy)  *
. **************************************************************
. 
. xi: quietly: reg lnIV100k_exp i.year i.year*cereal50k i.year*university   i.year
> *DAnySeas  i.year*DRivers i.year*DMedRds   i.Bairoch_id  if JewishCity==1,
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
i.Bairoch_id      _IBairoch_i_1-2151  (naturally coded; _IBairoch_i_1 omitted)

. predict lnIV100kresid_exp,r

. 
. lpoly lnIV100kresid jewsresid   if JewishCity==1 ,noscat ci

. 
. drop lnIV100kresid jewsresid

. 
. 
. 
. ************************************************************************
. * Table 1:  Reduced Form Regressions: growth
. ************************************************************************
. 
. 
. * Reg 1: lpop, year dummies
. eststo: xi: quietly: reg  lpop jewspresentDummy i.year  if JewishCity==1 & year>
> 1300, robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
(est1 stored)

. 
. * Reg 2: lpop, year dummies, controlsXyear
. eststo: xi: quietly: reg  lpop jewspresentDummy i.year i.year*cereal50k i.year*u
> niversity   i.year*DAnySeas  i.year*DRivers i.year*DMedRds    if JewishCity==1 &
>  year>1300, robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. 
. * Reg 3: lpop, year dummies, controlsXyear, city FE's
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds    if JewishCity==1
>  & year>1300, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est3 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy )  star(* 0.10 ** 0.05 *** 0.0
> 1)

------------------------------------------------------------
                      (1)             (2)             (3)   
                     lpop            lpop            lpop   
------------------------------------------------------------
jewspresen~y        0.175***        0.273***        0.350***
                 (0.0399)        (0.0379)        (0.0455)   
------------------------------------------------------------
N                    2898            2898            2898   
r2                 0.0888           0.212           0.471   
------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. * Reg 4: lpop, year dummies
. eststo: xi: quietly: reg  lpop jewspresentDummy i.year  if year>1300, robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
(est1 stored)

. 
. * Reg 5: lpop, year dummies, controlsXyear
. eststo: xi: quietly: reg  lpop jewspresentDummy i.year i.year*cereal50k i.year*u
> niversity   i.year*DAnySeas  i.year*DRivers i.year*DMedRds     if year>1300 , ro
> bust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. 
. * Reg 6: lpop, year dummies, controlsXyear, city FE's
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds    if year>1300, fe
>  robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est3 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy )  star(* 0.10 ** 0.05 *** 0.0
> 1)

------------------------------------------------------------
                      (1)             (2)             (3)   
                     lpop            lpop            lpop   
------------------------------------------------------------
jewspresen~y        0.625***        0.641***        0.302***
                 (0.0307)        (0.0305)        (0.0430)   
------------------------------------------------------------
N                    8440            8440            8440   
r2                  0.156           0.222           0.445   
------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. ************************************************************************
. * Table 2 Panel A: IV Regressions: Reduced Form, lpop, JewishCity==1
. ************************************************************************
. 
. 
. * Jewish Network IV's
. 
. *Reg 1: lpop, 0k
. eststo: xi: xtivreg2  lpop (jewspresentDummy=lnIV0k) i.year i.year*cereal50k i.y
> ear*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds  if JewishCity==
> 1 & year>1300,fe robust ffirst
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
Warning - singleton groups detected.  9 observation(s) not used.
Warning - duplicate variables detected
Duplicates:    _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750 _Iyear_1800
               _Iyear_1850
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2360)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2360)
jewspresentD |     677.05    0.0000 |      687.67   0.0000 |      677.05

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=319.28   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     802.54
Kleibergen-Paap Wald rk F statistic                               677.05

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2360)=     53.74     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     54.59     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     49.28     P-val=0.0000

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         37
Number of endogenous regressors      K1 =          1
Number of instruments                L  =         37
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 37,  2360) =    41.42
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =   0.4670
Total (uncentered) SS   =   1080.04002                Uncentered R2 =   0.4670
Residual SS             =   575.680978                Root MSE      =    .4901

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |   .4668948   .0615125     7.59   0.000     .3463325    .5874571
    _Iyear_1500 |   .7487574   .3957343     1.89   0.058    -.0268675    1.524382
    _Iyear_1600 |   1.180828   .3766389     3.14   0.002     .4426294    1.919027
    _Iyear_1700 |   1.171808    .360959     3.25   0.001     .4643417    1.879275
    _Iyear_1750 |   1.179196   .3538149     3.33   0.001     .4857316     1.87266
    _Iyear_1800 |   1.325056   .3626168     3.65   0.000       .61434    2.035772
    _Iyear_1850 |   1.622161   .3744238     4.33   0.000      .888304    2.356018
 _IyeaXcer_1500 |  -.1062837   .0847683    -1.25   0.210    -.2724266    .0598591
 _IyeaXcer_1600 |  -.1464929   .0804774    -1.82   0.069    -.3042256    .0112398
 _IyeaXcer_1700 |  -.0976865   .0775731    -1.26   0.208    -.2497269    .0543539
 _IyeaXcer_1750 |  -.0641013   .0762208    -0.84   0.400    -.2134913    .0852887
 _IyeaXcer_1800 |   -.037019   .0782994    -0.47   0.636     -.190483     .116445
 _IyeaXcer_1850 |  -.0133031   .0808755    -0.16   0.869    -.1718162    .1452101
 _IyeaXuni_1500 |  -.1235908    .137368    -0.90   0.368    -.3928271    .1456455
 _IyeaXuni_1600 |  -.0072074   .1441508    -0.05   0.960    -.2897379     .275323
 _IyeaXuni_1700 |  -.0369078   .1394234    -0.26   0.791    -.3101726    .2363571
 _IyeaXuni_1750 |   -.124527    .132185    -0.94   0.346    -.3836048    .1345509
 _IyeaXuni_1800 |  -.2619105   .1342901    -1.95   0.051    -.5251144    .0012933
 _IyeaXuni_1850 |   -.356196   .1434708    -2.48   0.013    -.6373935   -.0749985
 _IyeaXDAn_1500 |   1.51e-07   3.60e-07     0.42   0.676    -5.55e-07    8.56e-07
 _IyeaXDAn_1600 |   3.89e-07   3.53e-07     1.10   0.270    -3.02e-07    1.08e-06
 _IyeaXDAn_1700 |  -6.23e-07   3.35e-07    -1.86   0.063    -1.28e-06    3.45e-08
 _IyeaXDAn_1750 |  -3.60e-07   3.26e-07    -1.10   0.270    -9.98e-07    2.79e-07
 _IyeaXDAn_1800 |  -7.48e-07   3.32e-07    -2.25   0.024    -1.40e-06   -9.71e-08
 _IyeaXDAn_1850 |  -7.51e-07   3.58e-07    -2.10   0.036    -1.45e-06   -5.00e-08
 _IyeaXDRi_1500 |   3.23e-07   1.07e-06     0.30   0.763    -1.78e-06    2.42e-06
 _IyeaXDRi_1600 |   7.55e-07   9.95e-07     0.76   0.448    -1.20e-06    2.71e-06
 _IyeaXDRi_1700 |   1.10e-06   9.74e-07     1.12   0.261    -8.14e-07    3.00e-06
 _IyeaXDRi_1750 |   6.86e-07   9.65e-07     0.71   0.477    -1.21e-06    2.58e-06
 _IyeaXDRi_1800 |   8.07e-07   9.92e-07     0.81   0.416    -1.14e-06    2.75e-06
 _IyeaXDRi_1850 |   6.71e-07   1.07e-06     0.63   0.531    -1.43e-06    2.77e-06
 _IyeaXDMe_1500 |   2.81e-07   7.97e-07     0.35   0.724    -1.28e-06    1.84e-06
 _IyeaXDMe_1600 |   1.30e-06   7.49e-07     1.73   0.083    -1.70e-07    2.77e-06
 _IyeaXDMe_1700 |   1.00e-06   7.41e-07     1.35   0.177    -4.52e-07    2.45e-06
 _IyeaXDMe_1750 |   1.14e-06   7.30e-07     1.56   0.118    -2.89e-07    2.57e-06
 _IyeaXDMe_1800 |   6.05e-07   7.60e-07     0.80   0.426    -8.85e-07    2.09e-06
 _IyeaXDMe_1850 |   3.86e-07   8.28e-07     0.47   0.641    -1.24e-06    2.01e-06
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):            319.282
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              802.540
                         (Kleibergen-Paap rk Wald F statistic):        677.052
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850
Excluded instruments: lnIV0k
Duplicates:           _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------
(est1 stored)

. 
. *Reg 2: lpop, 50k
. eststo: xi: xtivreg2  lpop (jewspresentDummy=lnIV50k) i.year i.year*cereal50k i.
> year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   if JewishCity
> ==1 & year>1300,fe robust ffirst
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
Warning - singleton groups detected.  9 observation(s) not used.
Warning - duplicate variables detected
Duplicates:    _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750 _Iyear_1800
               _Iyear_1850
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2360)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2360)
jewspresentD |     676.60    0.0000 |      687.20   0.0000 |      676.60

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=284.64   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     705.96
Kleibergen-Paap Wald rk F statistic                               676.60

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2360)=     48.28     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     49.04     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     44.72     P-val=0.0000

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         37
Number of endogenous regressors      K1 =          1
Number of instruments                L  =         37
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 37,  2360) =    41.40
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =   0.4669
Total (uncentered) SS   =   1080.04002                Uncentered R2 =   0.4669
Residual SS             =  575.7240981                Root MSE      =    .4901

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |    .467475   .0643343     7.27   0.000     .3413821    .5935679
    _Iyear_1500 |    .749318   .3957388     1.89   0.058    -.0263158    1.524952
    _Iyear_1600 |    1.18123   .3762182     3.14   0.002     .4438555    1.918604
    _Iyear_1700 |   1.172204   .3606783     3.25   0.001     .4652877    1.879121
    _Iyear_1750 |   1.179468   .3534782     3.34   0.001     .4866635    1.872273
    _Iyear_1800 |   1.325241   .3623645     3.66   0.000     .6150192    2.035462
    _Iyear_1850 |   1.622361   .3740659     4.34   0.000      .889205    2.355516
 _IyeaXcer_1500 |  -.1063715   .0847457    -1.26   0.209      -.27247    .0597271
 _IyeaXcer_1600 |  -.1465428   .0804175    -1.82   0.068    -.3041583    .0110727
 _IyeaXcer_1700 |  -.0977266   .0775272    -1.26   0.207    -.2496772     .054224
 _IyeaXcer_1750 |  -.0641303   .0761771    -0.84   0.400    -.2134347    .0851741
 _IyeaXcer_1800 |  -.0370368    .078269    -0.47   0.636    -.1904412    .1163677
 _IyeaXcer_1850 |  -.0133375   .0808125    -0.17   0.869    -.1717272    .1450521
 _IyeaXuni_1500 |   -.123635   .1374586    -0.90   0.368    -.3930489    .1457789
 _IyeaXuni_1600 |  -.0072192   .1441878    -0.05   0.960     -.289822    .2753836
 _IyeaXuni_1700 |  -.0368058   .1393711    -0.26   0.792    -.3099682    .2363566
 _IyeaXuni_1750 |  -.1244229   .1321857    -0.94   0.347     -.383502    .1346563
 _IyeaXuni_1800 |  -.2618463   .1342875    -1.95   0.051    -.5250449    .0013523
 _IyeaXuni_1850 |  -.3561392   .1434567    -2.48   0.013    -.6373091   -.0749693
 _IyeaXDAn_1500 |   1.50e-07   3.60e-07     0.42   0.677    -5.56e-07    8.57e-07
 _IyeaXDAn_1600 |   3.90e-07   3.53e-07     1.10   0.269    -3.02e-07    1.08e-06
 _IyeaXDAn_1700 |  -6.22e-07   3.35e-07    -1.86   0.063    -1.28e-06    3.42e-08
 _IyeaXDAn_1750 |  -3.59e-07   3.26e-07    -1.10   0.270    -9.98e-07    2.79e-07
 _IyeaXDAn_1800 |  -7.47e-07   3.32e-07    -2.25   0.024    -1.40e-06   -9.73e-08
 _IyeaXDAn_1850 |  -7.51e-07   3.58e-07    -2.10   0.036    -1.45e-06   -4.98e-08
 _IyeaXDRi_1500 |   3.23e-07   1.07e-06     0.30   0.763    -1.78e-06    2.42e-06
 _IyeaXDRi_1600 |   7.55e-07   9.95e-07     0.76   0.448    -1.20e-06    2.71e-06
 _IyeaXDRi_1700 |   1.10e-06   9.74e-07     1.13   0.260    -8.12e-07    3.00e-06
 _IyeaXDRi_1750 |   6.86e-07   9.65e-07     0.71   0.477    -1.21e-06    2.58e-06
 _IyeaXDRi_1800 |   8.07e-07   9.92e-07     0.81   0.416    -1.14e-06    2.75e-06
 _IyeaXDRi_1850 |   6.71e-07   1.07e-06     0.63   0.531    -1.43e-06    2.77e-06
 _IyeaXDMe_1500 |   2.81e-07   7.97e-07     0.35   0.725    -1.28e-06    1.84e-06
 _IyeaXDMe_1600 |   1.30e-06   7.49e-07     1.73   0.083    -1.70e-07    2.77e-06
 _IyeaXDMe_1700 |   1.00e-06   7.41e-07     1.35   0.177    -4.52e-07    2.45e-06
 _IyeaXDMe_1750 |   1.14e-06   7.30e-07     1.56   0.118    -2.89e-07    2.57e-06
 _IyeaXDMe_1800 |   6.05e-07   7.61e-07     0.80   0.426    -8.85e-07    2.10e-06
 _IyeaXDMe_1850 |   3.87e-07   8.29e-07     0.47   0.641    -1.24e-06    2.01e-06
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):            284.638
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              705.957
                         (Kleibergen-Paap rk Wald F statistic):        676.597
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850
Excluded instruments: lnIV50k
Duplicates:           _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------
(est2 stored)

. 
. *Reg : lpop, 100k
. eststo: xi: xtivreg2  lpop (jewspresentDummy=lnIV100k) i.year i.year*cereal50k i
> .year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds    if JewishCi
> ty==1 & year>1300,fe robust ffirst
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
Warning - singleton groups detected.  9 observation(s) not used.
Warning - duplicate variables detected
Duplicates:    _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750 _Iyear_1800
               _Iyear_1850
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2360)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2360)
jewspresentD |     540.73    0.0000 |      549.21   0.0000 |      540.73

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=255.81   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     588.04
Kleibergen-Paap Wald rk F statistic                               540.73

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2360)=     45.66     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     46.37     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     42.72     P-val=0.0000

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         37
Number of endogenous regressors      K1 =          1
Number of instruments                L  =         37
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 37,  2360) =    41.38
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =   0.4651
Total (uncentered) SS   =   1080.04002                Uncentered R2 =   0.4651
Residual SS             =  577.6635896                Root MSE      =    .4909

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |   .4911185   .0695298     7.06   0.000     .3548426    .6273944
    _Iyear_1500 |   .7721615   .3956775     1.95   0.051    -.0033521    1.547675
    _Iyear_1600 |   1.197597   .3764327     3.18   0.001     .4598024    1.935392
    _Iyear_1700 |   1.188334   .3603411     3.30   0.001     .4820786     1.89459
    _Iyear_1750 |   1.190555   .3529927     3.37   0.001     .4987023    1.882408
    _Iyear_1800 |   1.332772   .3619916     3.68   0.000     .6232814    2.042262
    _Iyear_1850 |   1.630496   .3733211     4.37   0.000     .8987999    2.362192
 _IyeaXcer_1500 |  -.1099467   .0846569    -1.30   0.194    -.2758713    .0559779
 _IyeaXcer_1600 |  -.1485756    .080391    -1.85   0.065    -.3061392    .0089879
 _IyeaXcer_1700 |  -.0993631   .0773851    -1.28   0.199     -.251035    .0523088
 _IyeaXcer_1750 |  -.0653119   .0760252    -0.86   0.390    -.2143184    .0836947
 _IyeaXcer_1800 |  -.0377592   .0781403    -0.48   0.629    -.1909115     .115393
 _IyeaXcer_1850 |  -.0147413   .0806002    -0.18   0.855    -.1727148    .1432323
 _IyeaXuni_1500 |  -.1254362   .1385363    -0.91   0.365    -.3969624      .14609
 _IyeaXuni_1600 |  -.0076988   .1452085    -0.05   0.958    -.2923021    .2769046
 _IyeaXuni_1700 |  -.0326513   .1406135    -0.23   0.816    -.3082488    .2429461
 _IyeaXuni_1750 |  -.1201809   .1336442    -0.90   0.369    -.3821188    .1417571
 _IyeaXuni_1800 |  -.2592296   .1356292    -1.91   0.056     -.525058    .0065988
 _IyeaXuni_1850 |  -.3538237   .1443689    -2.45   0.014    -.6367815   -.0708658
 _IyeaXDAn_1500 |   1.37e-07   3.62e-07     0.38   0.705    -5.72e-07    8.46e-07
 _IyeaXDAn_1600 |   4.04e-07   3.54e-07     1.14   0.255    -2.91e-07    1.10e-06
 _IyeaXDAn_1700 |  -6.14e-07   3.37e-07    -1.82   0.068    -1.27e-06    4.59e-08
 _IyeaXDAn_1750 |  -3.43e-07   3.28e-07    -1.05   0.296    -9.86e-07    3.00e-07
 _IyeaXDAn_1800 |  -7.31e-07   3.34e-07    -2.19   0.028    -1.39e-06   -7.74e-08
 _IyeaXDAn_1850 |  -7.41e-07   3.59e-07    -2.06   0.039    -1.45e-06   -3.65e-08
 _IyeaXDRi_1500 |   3.15e-07   1.07e-06     0.30   0.768    -1.78e-06    2.41e-06
 _IyeaXDRi_1600 |   7.73e-07   9.95e-07     0.78   0.437    -1.18e-06    2.72e-06
 _IyeaXDRi_1700 |   1.12e-06   9.73e-07     1.15   0.252    -7.92e-07    3.02e-06
 _IyeaXDRi_1750 |   6.87e-07   9.64e-07     0.71   0.476    -1.20e-06    2.57e-06
 _IyeaXDRi_1800 |   8.13e-07   9.90e-07     0.82   0.412    -1.13e-06    2.75e-06
 _IyeaXDRi_1850 |   6.76e-07   1.07e-06     0.63   0.527    -1.42e-06    2.77e-06
 _IyeaXDMe_1500 |   2.69e-07   7.97e-07     0.34   0.736    -1.29e-06    1.83e-06
 _IyeaXDMe_1600 |   1.31e-06   7.49e-07     1.74   0.081    -1.62e-07    2.77e-06
 _IyeaXDMe_1700 |   1.01e-06   7.41e-07     1.36   0.173    -4.42e-07    2.46e-06
 _IyeaXDMe_1750 |   1.16e-06   7.29e-07     1.60   0.110    -2.65e-07    2.59e-06
 _IyeaXDMe_1800 |   6.26e-07   7.59e-07     0.82   0.409    -8.62e-07    2.11e-06
 _IyeaXDMe_1850 |   4.15e-07   8.28e-07     0.50   0.616    -1.21e-06    2.04e-06
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):            255.807
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              588.043
                         (Kleibergen-Paap rk Wald F statistic):        540.735
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850
Excluded instruments: lnIV100k
Duplicates:           _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------
(est3 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy )  star(* 0.10 ** 0.05 *** 0.0
> 1)

------------------------------------------------------------
                      (1)             (2)             (3)   
                     lpop            lpop            lpop   
------------------------------------------------------------
jewspresen~y        0.467***        0.467***        0.491***
                 (0.0615)        (0.0643)        (0.0695)   
------------------------------------------------------------
N                    2889            2889            2889   
r2                  0.467           0.467           0.465   
------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. *Reg : lpop, 250k
. eststo: xi: xtivreg2  lpop (jewspresentDummy=lnIV250k) i.year i.year*cereal50k i
> .year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   if JewishCit
> y==1 & year>1300,fe robust ffirst
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
Warning - singleton groups detected.  9 observation(s) not used.
Warning - duplicate variables detected
Duplicates:    _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750 _Iyear_1800
               _Iyear_1850
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2360)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2360)
jewspresentD |     179.84    0.0000 |      182.66   0.0000 |      179.84

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=130.27   P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                     235.61
Kleibergen-Paap Wald rk F statistic                               179.84

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2360)=     24.24     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     24.62     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     23.23     P-val=0.0000

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         37
Number of endogenous regressors      K1 =          1
Number of instruments                L  =         37
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 37,  2360) =    41.18
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =   0.4623
Total (uncentered) SS   =   1080.04002                Uncentered R2 =   0.4623
Residual SS             =  580.7567409                Root MSE      =    .4922

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |   .5222176   .1004864     5.20   0.000     .3252679    .7191673
    _Iyear_1500 |   .8022084   .3960919     2.03   0.043     .0258826    1.578534
    _Iyear_1600 |   1.219126   .3766631     3.24   0.001     .4808795    1.957372
    _Iyear_1700 |    1.20955   .3580227     3.38   0.001     .5078389    1.911262
    _Iyear_1750 |   1.205139   .3507247     3.44   0.001     .5177306    1.892546
    _Iyear_1800 |   1.342678    .360029     3.73   0.000     .6370341    2.048322
    _Iyear_1850 |   1.641196   .3707399     4.43   0.000     .9145592    2.367833
 _IyeaXcer_1500 |  -.1146493   .0844482    -1.36   0.175    -.2801647     .050866
 _IyeaXcer_1600 |  -.1512495   .0802355    -1.89   0.059    -.3085082    .0060091
 _IyeaXcer_1700 |  -.1015155   .0768735    -1.32   0.187    -.2521849    .0491538
 _IyeaXcer_1750 |   -.066866    .075591    -0.88   0.376    -.2150216    .0812896
 _IyeaXcer_1800 |  -.0387095   .0778105    -0.50   0.619    -.1912154    .1137963
 _IyeaXcer_1850 |  -.0165876   .0800595    -0.21   0.836    -.1735014    .1403262
 _IyeaXuni_1500 |  -.1278054   .1403368    -0.91   0.362    -.4028604    .1472496
 _IyeaXuni_1600 |  -.0083296   .1466791    -0.06   0.955    -.2958153    .2791561
 _IyeaXuni_1700 |  -.0271868   .1423406    -0.19   0.849    -.3061692    .2517956
 _IyeaXuni_1750 |  -.1146012   .1357176    -0.84   0.398    -.3806028    .1514003
 _IyeaXuni_1800 |  -.2557876   .1373175    -1.86   0.062     -.524925    .0133497
 _IyeaXuni_1850 |   -.350778   .1456353    -2.41   0.016    -.6362181    -.065338
 _IyeaXDAn_1500 |   1.19e-07   3.64e-07     0.33   0.743    -5.95e-07    8.33e-07
 _IyeaXDAn_1600 |   4.22e-07   3.60e-07     1.17   0.242    -2.84e-07    1.13e-06
 _IyeaXDAn_1700 |  -6.02e-07   3.41e-07    -1.77   0.077    -1.27e-06    6.53e-08
 _IyeaXDAn_1750 |  -3.22e-07   3.36e-07    -0.96   0.338    -9.81e-07    3.37e-07
 _IyeaXDAn_1800 |  -7.10e-07   3.41e-07    -2.09   0.037    -1.38e-06   -4.27e-08
 _IyeaXDAn_1850 |  -7.28e-07   3.65e-07    -2.00   0.046    -1.44e-06   -1.34e-08
 _IyeaXDRi_1500 |   3.05e-07   1.07e-06     0.29   0.775    -1.79e-06    2.40e-06
 _IyeaXDRi_1600 |   7.97e-07   9.96e-07     0.80   0.424    -1.15e-06    2.75e-06
 _IyeaXDRi_1700 |   1.14e-06   9.73e-07     1.17   0.241    -7.67e-07    3.05e-06
 _IyeaXDRi_1750 |   6.87e-07   9.62e-07     0.71   0.475    -1.20e-06    2.57e-06
 _IyeaXDRi_1800 |   8.20e-07   9.88e-07     0.83   0.406    -1.12e-06    2.76e-06
 _IyeaXDRi_1850 |   6.82e-07   1.07e-06     0.64   0.522    -1.41e-06    2.77e-06
 _IyeaXDMe_1500 |   2.54e-07   7.97e-07     0.32   0.750    -1.31e-06    1.82e-06
 _IyeaXDMe_1600 |   1.32e-06   7.51e-07     1.76   0.079    -1.54e-07    2.79e-06
 _IyeaXDMe_1700 |   1.02e-06   7.42e-07     1.38   0.168    -4.32e-07    2.48e-06
 _IyeaXDMe_1750 |   1.19e-06   7.33e-07     1.63   0.103    -2.43e-07    2.63e-06
 _IyeaXDMe_1800 |   6.55e-07   7.62e-07     0.86   0.390    -8.39e-07    2.15e-06
 _IyeaXDMe_1850 |   4.53e-07   8.34e-07     0.54   0.587    -1.18e-06    2.09e-06
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):            130.273
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):              235.611
                         (Kleibergen-Paap rk Wald F statistic):        179.838
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850
Excluded instruments: lnIV250k
Duplicates:           _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------
(est1 stored)

. 
. *Reg : lpop, 500k
. eststo: xi: xtivreg2  lpop (jewspresentDummy=lnIV500k) i.year i.year*cereal50k i
> .year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   if JewishCit
> y==1 & year>1300,fe robust ffirst
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
Warning - singleton groups detected.  9 observation(s) not used.
Warning - duplicate variables detected
Duplicates:    _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750 _Iyear_1800
               _Iyear_1850
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2360)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2360)
jewspresentD |      11.84    0.0006 |       12.03   0.0005 |       11.84

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=11.69    P-val=0.0006

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      17.02
Kleibergen-Paap Wald rk F statistic                                11.84

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2360)=      0.79     P-val=0.3750
Anderson-Rubin Wald test           Chi-sq(1)=      0.80     P-val=0.3712
Stock-Wright LM S statistic        Chi-sq(1)=      0.80     P-val=0.3715

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         37
Number of endogenous regressors      K1 =          1
Number of instruments                L  =         37
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 37,  2360) =    41.33
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =   0.4710
Total (uncentered) SS   =   1080.04002                Uncentered R2 =   0.4710
Residual SS             =  571.3673626                Root MSE      =    .4882

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |     .34844   .3673363     0.95   0.343     -.371526    1.068406
    _Iyear_1500 |   .6343104   .5462814     1.16   0.246    -.4363815    1.705002
    _Iyear_1600 |   1.098827   .4718646     2.33   0.020      .173989    2.023664
    _Iyear_1700 |   1.090997   .4662873     2.34   0.019     .1770904    2.004903
    _Iyear_1750 |   1.123649   .4119122     2.73   0.006     .3163158    1.930982
    _Iyear_1800 |   1.287324   .3953348     3.26   0.001     .5124818    2.062166
    _Iyear_1850 |   1.581404   .4113174     3.84   0.000     .7752371    2.387572
 _IyeaXcer_1500 |  -.0883718   .1036926    -0.85   0.394    -.2916054    .1148619
 _IyeaXcer_1600 |  -.1363082   .0890885    -1.53   0.126    -.3109185    .0383021
 _IyeaXcer_1700 |  -.0894878   .0853984    -1.05   0.295    -.2568656      .07789
 _IyeaXcer_1750 |  -.0581816   .0811259    -0.72   0.473    -.2171853    .1008222
 _IyeaXcer_1800 |  -.0333994   .0811551    -0.41   0.681    -.1924605    .1256617
 _IyeaXcer_1850 |  -.0062703   .0868239    -0.07   0.942     -.176442    .1639013
 _IyeaXuni_1500 |  -.1145667   .1365415    -0.84   0.401    -.3821831    .1530498
 _IyeaXuni_1600 |  -.0048045   .1403265    -0.03   0.973    -.2798394    .2702303
 _IyeaXuni_1700 |  -.0577219   .1491816    -0.39   0.699    -.3501125    .2346686
 _IyeaXuni_1750 |  -.1457795   .1426582    -1.02   0.307    -.4253844    .1338254
 _IyeaXuni_1800 |  -.2750206      .1356    -2.03   0.043    -.5407917   -.0092494
 _IyeaXuni_1850 |  -.3677968   .1446991    -2.54   0.011    -.6514017   -.0841918
 _IyeaXDAn_1500 |   2.17e-07   4.27e-07     0.51   0.611    -6.20e-07    1.05e-06
 _IyeaXDAn_1600 |   3.19e-07   3.88e-07     0.82   0.411    -4.42e-07    1.08e-06
 _IyeaXDAn_1700 |  -6.66e-07   3.43e-07    -1.94   0.052    -1.34e-06    5.67e-09
 _IyeaXDAn_1750 |  -4.40e-07   3.83e-07    -1.15   0.252    -1.19e-06    3.12e-07
 _IyeaXDAn_1800 |  -8.27e-07   3.89e-07    -2.12   0.034    -1.59e-06   -6.42e-08
 _IyeaXDAn_1850 |  -8.00e-07   3.67e-07    -2.18   0.029    -1.52e-06   -8.14e-08
 _IyeaXDRi_1500 |   3.62e-07   1.10e-06     0.33   0.743    -1.80e-06    2.52e-06
 _IyeaXDRi_1600 |   6.64e-07   1.02e-06     0.65   0.517    -1.34e-06    2.67e-06
 _IyeaXDRi_1700 |   9.99e-07   1.01e-06     0.99   0.321    -9.76e-07    2.97e-06
 _IyeaXDRi_1750 |   6.83e-07   9.79e-07     0.70   0.486    -1.24e-06    2.60e-06
 _IyeaXDRi_1800 |   7.80e-07   1.01e-06     0.78   0.438    -1.19e-06    2.75e-06
 _IyeaXDRi_1850 |   6.47e-07   1.09e-06     0.60   0.552    -1.48e-06    2.78e-06
 _IyeaXDMe_1500 |   3.39e-07   8.19e-07     0.41   0.679    -1.27e-06    1.95e-06
 _IyeaXDMe_1600 |   1.26e-06   7.69e-07     1.63   0.103    -2.52e-07    2.76e-06
 _IyeaXDMe_1700 |   9.55e-07   7.66e-07     1.25   0.213    -5.47e-07    2.46e-06
 _IyeaXDMe_1750 |   1.03e-06   8.33e-07     1.24   0.216    -6.03e-07    2.66e-06
 _IyeaXDMe_1800 |   4.98e-07   8.54e-07     0.58   0.560    -1.18e-06    2.17e-06
 _IyeaXDMe_1850 |   2.43e-07   9.58e-07     0.25   0.800    -1.63e-06    2.12e-06
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             11.685
                                                   Chi-sq(1) P-val =    0.0006
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               17.021
                         (Kleibergen-Paap rk Wald F statistic):         11.845
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850
Excluded instruments: lnIV500k
Duplicates:           _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy )  star(* 0.10 ** 0.05 *** 0.0
> 1)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y        0.522***        0.348   
                  (0.100)         (0.367)   
--------------------------------------------
N                    2889            2889   
r2                  0.462           0.471   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. ************************************************************************
. * Table 2 Panel B: IV Regressions: Reduced Form, lpop, JewishCity==1
. ************************************************************************
. 
. 
. * Jewish Expulsions IV's
. 
. *Reg 1: lpop, 0k
. eststo: xi: xtivreg2  lpop (jewspresentDummy=lnIV0k_exp) i.year i.year*cereal50k
>  i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds  if JewishCi
> ty==1 & year>1300,fe robust ffirst
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
Warning - singleton groups detected.  9 observation(s) not used.
Warning - duplicate variables detected
Duplicates:    _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750 _Iyear_1800
               _Iyear_1850
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2360)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2360)
jewspresentD |      51.78    0.0000 |       52.59   0.0000 |       51.78

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=57.61    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      64.43
Kleibergen-Paap Wald rk F statistic                                51.78

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2360)=      0.55     P-val=0.4567
Anderson-Rubin Wald test           Chi-sq(1)=      0.56     P-val=0.4531
Stock-Wright LM S statistic        Chi-sq(1)=      0.56     P-val=0.4525

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         37
Number of endogenous regressors      K1 =          1
Number of instruments                L  =         37
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 37,  2360) =    39.49
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =   0.4560
Total (uncentered) SS   =   1080.04002                Uncentered R2 =   0.4560
Residual SS             =  587.5046235                Root MSE      =    .4951

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |   .1253502   .1652347     0.76   0.448    -.1985038    .4492043
    _Iyear_1500 |   .4187687   .4453704     0.94   0.347    -.4541412    1.291679
    _Iyear_1600 |   .9443908   .4055467     2.33   0.020      .149534    1.739248
    _Iyear_1700 |   .9388014   .3954511     2.37   0.018     .1637315    1.713871
    _Iyear_1750 |   1.019035   .3791988     2.69   0.007     .2758193    1.762251
    _Iyear_1800 |   1.216262   .3833722     3.17   0.002      .464866    1.967657
    _Iyear_1850 |   1.504646    .397405     3.79   0.000     .7257467    2.283546
 _IyeaXcer_1500 |  -.0546375   .0934582    -0.58   0.559    -.2378123    .1285372
 _IyeaXcer_1600 |   -.117127   .0850533    -1.38   0.168    -.2838285    .0495745
 _IyeaXcer_1700 |   -.074047   .0829115    -0.89   0.372    -.2365506    .0884566
 _IyeaXcer_1750 |  -.0470328   .0811384    -0.58   0.562    -.2060611    .1119955
 _IyeaXcer_1800 |  -.0265823   .0827558    -0.32   0.748    -.1887807     .135616
 _IyeaXcer_1850 |   .0069746   .0864369     0.08   0.936    -.1624387    .1763879
 _IyeaXuni_1500 |  -.0975712    .132337    -0.74   0.461    -.3569469    .1618045
 _IyeaXuni_1600 |  -.0002792   .1371506    -0.00   0.998    -.2690895    .2685311
 _IyeaXuni_1700 |  -.0969219   .1340751    -0.72   0.470    -.3597043    .1658605
 _IyeaXuni_1750 |  -.1858051   .1260706    -1.47   0.141    -.4328988    .0612886
 _IyeaXuni_1800 |  -.2997112     .12648    -2.37   0.018    -.5476074    -.051815
 _IyeaXuni_1850 |  -.3896448   .1403931    -2.78   0.006    -.6648103   -.1144793
 _IyeaXDAn_1500 |   3.43e-07   3.69e-07     0.93   0.353    -3.81e-07    1.07e-06
 _IyeaXDAn_1600 |   1.86e-07   3.62e-07     0.51   0.607    -5.23e-07    8.96e-07
 _IyeaXDAn_1700 |  -7.47e-07   3.36e-07    -2.22   0.026    -1.41e-06   -8.80e-08
 _IyeaXDAn_1750 |  -5.91e-07   3.37e-07    -1.75   0.080    -1.25e-06    6.99e-08
 _IyeaXDAn_1800 |  -9.78e-07   3.49e-07    -2.80   0.005    -1.66e-06   -2.93e-07
 _IyeaXDAn_1850 |  -8.93e-07   3.65e-07    -2.45   0.014    -1.61e-06   -1.79e-07
 _IyeaXDRi_1500 |   4.34e-07   1.15e-06     0.38   0.707    -1.83e-06    2.70e-06
 _IyeaXDRi_1600 |   4.95e-07   1.06e-06     0.47   0.640    -1.58e-06    2.57e-06
 _IyeaXDRi_1700 |   8.17e-07   1.04e-06     0.78   0.433    -1.22e-06    2.86e-06
 _IyeaXDRi_1750 |   6.77e-07   1.03e-06     0.66   0.512    -1.35e-06    2.70e-06
 _IyeaXDRi_1800 |   7.28e-07   1.07e-06     0.68   0.495    -1.36e-06    2.82e-06
 _IyeaXDRi_1850 |   6.03e-07   1.15e-06     0.53   0.599    -1.64e-06    2.85e-06
 _IyeaXDMe_1500 |   4.49e-07   8.38e-07     0.54   0.592    -1.19e-06    2.09e-06
 _IyeaXDMe_1600 |   1.18e-06   7.73e-07     1.52   0.127    -3.37e-07    2.69e-06
 _IyeaXDMe_1700 |   8.70e-07   7.69e-07     1.13   0.258    -6.36e-07    2.38e-06
 _IyeaXDMe_1750 |   8.19e-07   7.72e-07     1.06   0.288    -6.93e-07    2.33e-06
 _IyeaXDMe_1800 |   2.97e-07   8.08e-07     0.37   0.714    -1.29e-06    1.88e-06
 _IyeaXDMe_1850 |  -2.64e-08   8.94e-07    -0.03   0.976    -1.78e-06    1.73e-06
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             57.606
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               64.435
                         (Kleibergen-Paap rk Wald F statistic):         51.779
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850
Excluded instruments: lnIV0k_exp
Duplicates:           _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------
(est1 stored)

. 
. *Reg 2: lpop, 50k
. eststo: xi: xtivreg2  lpop (jewspresentDummy=lnIV50k_exp) i.year i.year*cereal50
> k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   if Jewish
> City==1 & year>1300,fe robust ffirst
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
Warning - singleton groups detected.  9 observation(s) not used.
Warning - duplicate variables detected
Duplicates:    _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750 _Iyear_1800
               _Iyear_1850
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2360)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2360)
jewspresentD |      48.36    0.0000 |       49.12   0.0000 |       48.36

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=54.41    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      62.86
Kleibergen-Paap Wald rk F statistic                                48.36

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2360)=      4.95     P-val=0.0262
Anderson-Rubin Wald test           Chi-sq(1)=      5.03     P-val=0.0250
Stock-Wright LM S statistic        Chi-sq(1)=      4.81     P-val=0.0283

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         37
Number of endogenous regressors      K1 =          1
Number of instruments                L  =         37
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 37,  2360) =    41.29
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =   0.4707
Total (uncentered) SS   =   1080.04002                Uncentered R2 =   0.4707
Residual SS             =  571.6554794                Root MSE      =    .4884

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |   .3806339   .1723918     2.21   0.027     .0427521    .7185157
    _Iyear_1500 |    .665415   .4338559     1.53   0.125    -.1849268    1.515757
    _Iyear_1600 |   1.121113   .3987345     2.81   0.005     .3396079    1.902618
    _Iyear_1700 |    1.11296   .3840394     2.90   0.004     .3602565    1.865663
    _Iyear_1750 |   1.138746   .3669662     3.10   0.002     .4195051    1.857986
    _Iyear_1800 |   1.297579   .3711259     3.50   0.000     .5701853    2.024972
    _Iyear_1850 |   1.592481   .3821958     4.17   0.000     .8433914    2.341571
 _IyeaXcer_1500 |  -.0932399   .0899828    -1.04   0.300     -.269603    .0831232
 _IyeaXcer_1600 |  -.1390762   .0827701    -1.68   0.093    -.3013026    .0231502
 _IyeaXcer_1700 |   -.091716    .079577    -1.15   0.249     -.247684    .0642519
 _IyeaXcer_1750 |  -.0597905   .0777152    -0.77   0.442    -.2121094    .0925285
 _IyeaXcer_1800 |  -.0343831   .0794053    -0.43   0.665    -.1900147    .1212484
 _IyeaXcer_1850 |  -.0081817   .0826036    -0.10   0.921    -.1700818    .1537183
 _IyeaXuni_1500 |  -.1170193   .1339523    -0.87   0.382     -.379561    .1455224
 _IyeaXuni_1600 |  -.0054576   .1408499    -0.04   0.969    -.2815183    .2706031
 _IyeaXuni_1700 |   -.052065    .140217    -0.37   0.710    -.3268853    .2227552
 _IyeaXuni_1750 |  -.1400034   .1332495    -1.05   0.293    -.4011676    .1211607
 _IyeaXuni_1800 |  -.2714575   .1325409    -2.05   0.041    -.5312329   -.0116821
 _IyeaXuni_1850 |  -.3646439   .1427647    -2.55   0.011    -.6444576   -.0848302
 _IyeaXDAn_1500 |   1.99e-07   3.67e-07     0.54   0.587    -5.20e-07    9.19e-07
 _IyeaXDAn_1600 |   3.38e-07   3.64e-07     0.93   0.353    -3.76e-07    1.05e-06
 _IyeaXDAn_1700 |  -6.54e-07   3.38e-07    -1.93   0.053    -1.32e-06    8.47e-09
 _IyeaXDAn_1750 |  -4.18e-07   3.42e-07    -1.22   0.222    -1.09e-06    2.53e-07
 _IyeaXDAn_1800 |  -8.06e-07   3.49e-07    -2.31   0.021    -1.49e-06   -1.22e-07
 _IyeaXDAn_1850 |  -7.87e-07   3.65e-07    -2.16   0.031    -1.50e-06   -7.16e-08
 _IyeaXDRi_1500 |   3.51e-07   1.09e-06     0.32   0.746    -1.78e-06    2.48e-06
 _IyeaXDRi_1600 |   6.89e-07   1.01e-06     0.68   0.494    -1.28e-06    2.66e-06
 _IyeaXDRi_1700 |   1.03e-06   9.86e-07     1.04   0.298    -9.06e-07    2.96e-06
 _IyeaXDRi_1750 |   6.84e-07   9.75e-07     0.70   0.483    -1.23e-06    2.59e-06
 _IyeaXDRi_1800 |   7.87e-07   1.00e-06     0.78   0.433    -1.18e-06    2.75e-06
 _IyeaXDRi_1850 |   6.54e-07   1.08e-06     0.60   0.546    -1.47e-06    2.77e-06
 _IyeaXDMe_1500 |   3.23e-07   8.05e-07     0.40   0.688    -1.25e-06    1.90e-06
 _IyeaXDMe_1600 |   1.27e-06   7.53e-07     1.68   0.092    -2.09e-07    2.74e-06
 _IyeaXDMe_1700 |   9.67e-07   7.48e-07     1.29   0.196    -4.98e-07    2.43e-06
 _IyeaXDMe_1750 |   1.06e-06   7.51e-07     1.41   0.158    -4.13e-07    2.53e-06
 _IyeaXDMe_1800 |   5.27e-07   7.83e-07     0.67   0.501    -1.01e-06    2.06e-06
 _IyeaXDMe_1850 |   2.82e-07   8.68e-07     0.32   0.746    -1.42e-06    1.98e-06
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             54.409
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               62.857
                         (Kleibergen-Paap rk Wald F statistic):         48.363
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850
Excluded instruments: lnIV50k_exp
Duplicates:           _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------
(est2 stored)

. 
. *Reg : lpop, 100k
. eststo: xi: xtivreg2  lpop (jewspresentDummy=lnIV100k_exp) i.year i.year*cereal5
> 0k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   if Jewis
> hCity==1 & year>1300,fe robust ffirst
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
Warning - singleton groups detected.  9 observation(s) not used.
Warning - duplicate variables detected
Duplicates:    _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750 _Iyear_1800
               _Iyear_1850
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2360)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2360)
jewspresentD |      28.40    0.0000 |       28.85   0.0000 |       28.40

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=31.43    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      36.68
Kleibergen-Paap Wald rk F statistic                                28.40

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2360)=     14.15     P-val=0.0002
Anderson-Rubin Wald test           Chi-sq(1)=     14.38     P-val=0.0001
Stock-Wright LM S statistic        Chi-sq(1)=     12.86     P-val=0.0003

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         37
Number of endogenous regressors      K1 =          1
Number of instruments                L  =         37
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 37,  2360) =    37.44
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =   0.3931
Total (uncentered) SS   =   1080.04002                Uncentered R2 =   0.3931
Residual SS             =  655.4520424                Root MSE      =    .5229

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |   .8643721   .2553169     3.39   0.001     .3639602    1.364784
    _Iyear_1500 |   1.132786   .4869262     2.33   0.020     .1784286    2.087144
    _Iyear_1600 |   1.455985   .4403526     3.31   0.001     .5929098     2.31906
    _Iyear_1700 |   1.442974   .4161898     3.47   0.001     .6272566    2.258691
    _Iyear_1750 |   1.365585   .3901942     3.50   0.000     .6008186    2.130352
    _Iyear_1800 |   1.451666   .3874651     3.75   0.000     .6922487    2.211084
    _Iyear_1850 |   1.758921   .3954306     4.45   0.000     .9838911    2.533951
 _IyeaXcer_1500 |  -.1663878   .0962968    -1.73   0.084    -.3551261    .0223506
 _IyeaXcer_1600 |  -.1806679   .0873681    -2.07   0.039    -.3519061   -.0094296
 _IyeaXcer_1700 |  -.1251973   .0815241    -1.54   0.125    -.2849816     .034587
 _IyeaXcer_1750 |   -.083965   .0790538    -1.06   0.288    -.2389076    .0709776
 _IyeaXcer_1800 |  -.0491649   .0803299    -0.61   0.541    -.2066087    .1082789
 _IyeaXcer_1850 |  -.0369015   .0830834    -0.44   0.657     -.199742    .1259389
 _IyeaXuni_1500 |  -.1538715   .1664359    -0.92   0.355      -.48008    .1723369
 _IyeaXuni_1600 |  -.0152702   .1690317    -0.09   0.928    -.3465663    .3160258
 _IyeaXuni_1700 |   .0329345   .1709504     0.19   0.847    -.3021221    .3679911
 _IyeaXuni_1750 |  -.0532136   .1676589    -0.32   0.751    -.3818191    .2753918
 _IyeaXuni_1800 |  -.2179195    .165674    -1.32   0.188    -.5426346    .1067956
 _IyeaXuni_1850 |  -.3172695   .1678581    -1.89   0.059    -.6462653    .0117264
 _IyeaXDAn_1500 |  -7.38e-08   4.28e-07    -0.17   0.863    -9.12e-07    7.65e-07
 _IyeaXDAn_1600 |   6.25e-07   4.23e-07     1.48   0.139    -2.03e-07    1.45e-06
 _IyeaXDAn_1700 |  -4.78e-07   3.87e-07    -1.23   0.217    -1.24e-06    2.81e-07
 _IyeaXDAn_1750 |  -9.03e-08   4.07e-07    -0.22   0.824    -8.88e-07    7.08e-07
 _IyeaXDAn_1800 |  -4.80e-07   4.08e-07    -1.18   0.239    -1.28e-06    3.20e-07
 _IyeaXDAn_1850 |  -5.86e-07   4.11e-07    -1.42   0.155    -1.39e-06    2.21e-07
 _IyeaXDRi_1500 |   1.94e-07   1.10e-06     0.18   0.860    -1.96e-06    2.35e-06
 _IyeaXDRi_1600 |   1.06e-06   1.04e-06     1.01   0.311    -9.87e-07    3.10e-06
 _IyeaXDRi_1700 |   1.42e-06   1.02e-06     1.39   0.163    -5.75e-07    3.42e-06
 _IyeaXDRi_1750 |   6.96e-07   9.88e-07     0.70   0.481    -1.24e-06    2.63e-06
 _IyeaXDRi_1800 |   9.00e-07   1.01e-06     0.89   0.372    -1.08e-06    2.88e-06
 _IyeaXDRi_1850 |   7.50e-07   1.08e-06     0.70   0.486    -1.36e-06    2.86e-06
 _IyeaXDMe_1500 |   8.48e-08   8.36e-07     0.10   0.919    -1.55e-06    1.72e-06
 _IyeaXDMe_1600 |   1.44e-06   7.92e-07     1.82   0.069    -1.14e-07    2.99e-06
 _IyeaXDMe_1700 |   1.15e-06   7.77e-07     1.48   0.138    -3.70e-07    2.67e-06
 _IyeaXDMe_1750 |   1.52e-06   7.92e-07     1.92   0.055    -3.52e-08    3.07e-06
 _IyeaXDMe_1800 |   9.63e-07   8.17e-07     1.18   0.239    -6.39e-07    2.57e-06
 _IyeaXDMe_1850 |   8.66e-07   9.01e-07     0.96   0.337    -9.00e-07    2.63e-06
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             31.433
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               36.675
                         (Kleibergen-Paap rk Wald F statistic):         28.405
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850
Excluded instruments: lnIV100k_exp
Duplicates:           _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------
(est3 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy )  star(* 0.10 ** 0.05 *** 0.0
> 1)

------------------------------------------------------------
                      (1)             (2)             (3)   
                     lpop            lpop            lpop   
------------------------------------------------------------
jewspresen~y        0.125           0.381**         0.864***
                  (0.165)         (0.172)         (0.255)   
------------------------------------------------------------
N                    2889            2889            2889   
r2                  0.456           0.471           0.393   
------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. *Reg : lpop, 250k
. eststo: xi: xtivreg2  lpop (jewspresentDummy=lnIV250k_exp) i.year i.year*cereal5
> 0k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   if Jewis
> hCity==1 & year>1300,fe robust ffirst
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
Warning - singleton groups detected.  9 observation(s) not used.
Warning - duplicate variables detected
Duplicates:    _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750 _Iyear_1800
               _Iyear_1850
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2360)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2360)
jewspresentD |       9.51    0.0021 |        9.66   0.0019 |        9.51

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=9.25     P-val=0.0024

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                       9.84
Kleibergen-Paap Wald rk F statistic                                 9.51

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2360)=     38.00     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(1)=     38.60     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(1)=     34.65     P-val=0.0000

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         37
Number of endogenous regressors      K1 =          1
Number of instruments                L  =         37
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 37,  2360) =    11.38
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =  -1.2648
Total (uncentered) SS   =   1080.04002                Uncentered R2 =  -1.2648
Residual SS             =  2446.080825                Root MSE      =     1.01

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |   2.776952   .9183766     3.02   0.002      .976967    4.576937
    _Iyear_1500 |   2.980656    1.23736     2.41   0.016     .5554747    5.405838
    _Iyear_1600 |   2.779985   1.008434     2.76   0.006     .8034914    4.756479
    _Iyear_1700 |   2.747765   .9637175     2.85   0.004     .8589137    4.636617
    _Iyear_1750 |   2.262452   .8366603     2.70   0.007      .622628    3.902276
    _Iyear_1800 |   2.060891   .7769059     2.65   0.008     .5381833    3.583599
    _Iyear_1850 |   2.416981   .7991478     3.02   0.002     .8506801    3.983282
 _IyeaXcer_1500 |   -.455596   .2237815    -2.04   0.042    -.8941996   -.0169923
 _IyeaXcer_1600 |  -.3451107   .1775807    -1.94   0.052    -.6931626    .0029411
 _IyeaXcer_1700 |  -.2575737   .1617182    -1.59   0.111    -.5745355    .0593882
 _IyeaXcer_1750 |   -.179545   .1522305    -1.18   0.238    -.4779113    .1188213
 _IyeaXcer_1800 |  -.1076082    .149321    -0.72   0.471    -.4002719    .1850556
 _IyeaXcer_1850 |  -.1504526   .1584893    -0.95   0.342    -.4610859    .1601808
 _IyeaXuni_1500 |  -.2995761   .4259011    -0.70   0.482    -1.134327    .5351747
 _IyeaXuni_1600 |  -.0540669   .3869446    -0.14   0.889    -.8124643    .7043306
 _IyeaXuni_1700 |   .3690014   .3984165     0.93   0.354    -.4118807    1.149883
 _IyeaXuni_1750 |   .2899315   .4163749     0.70   0.486    -.5261483    1.106011
 _IyeaXuni_1800 |  -.0062436   .3956978    -0.02   0.987    -.7817971    .7693099
 _IyeaXuni_1850 |  -.1299629   .3884302    -0.33   0.738    -.8912721    .6313463
 _IyeaXDAn_1500 |  -1.15e-06   1.04e-06    -1.11   0.268    -3.19e-06    8.86e-07
 _IyeaXDAn_1600 |   1.76e-06   1.01e-06     1.74   0.081    -2.17e-07    3.74e-06
 _IyeaXDAn_1700 |   2.19e-07   8.76e-07     0.25   0.802    -1.50e-06    1.94e-06
 _IyeaXDAn_1750 |   1.21e-06   1.03e-06     1.17   0.242    -8.15e-07    3.22e-06
 _IyeaXDAn_1800 |   8.08e-07   1.02e-06     0.79   0.430    -1.20e-06    2.82e-06
 _IyeaXDAn_1850 |   2.10e-07   9.29e-07     0.23   0.821    -1.61e-06    2.03e-06
 _IyeaXDRi_1500 |  -4.26e-07   2.34e-06    -0.18   0.855    -5.01e-06    4.15e-06
 _IyeaXDRi_1600 |   2.51e-06   2.22e-06     1.13   0.258    -1.84e-06    6.86e-06
 _IyeaXDRi_1700 |   2.98e-06   2.22e-06     1.34   0.180    -1.38e-06    7.34e-06
 _IyeaXDRi_1750 |   7.46e-07   2.05e-06     0.36   0.717    -3.28e-06    4.77e-06
 _IyeaXDRi_1800 |   1.35e-06   2.09e-06     0.65   0.519    -2.74e-06    5.44e-06
 _IyeaXDRi_1850 |   1.13e-06   2.12e-06     0.53   0.594    -3.02e-06    5.28e-06
 _IyeaXDMe_1500 |  -8.59e-07   1.72e-06    -0.50   0.617    -4.22e-06    2.50e-06
 _IyeaXDMe_1600 |   2.11e-06   1.55e-06     1.36   0.173    -9.28e-07    5.15e-06
 _IyeaXDMe_1700 |   1.88e-06   1.48e-06     1.27   0.203    -1.02e-06    4.78e-06
 _IyeaXDMe_1750 |   3.32e-06   1.67e-06     1.99   0.047     5.14e-08    6.59e-06
 _IyeaXDMe_1800 |   2.69e-06   1.67e-06     1.61   0.106    -5.76e-07    5.95e-06
 _IyeaXDMe_1850 |   3.17e-06   1.86e-06     1.71   0.087    -4.62e-07    6.81e-06
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):              9.252
                                                   Chi-sq(1) P-val =    0.0024
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                9.840
                         (Kleibergen-Paap rk Wald F statistic):          9.514
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850
Excluded instruments: lnIV250k_exp
Duplicates:           _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------
(est1 stored)

. 
. *Reg : lpop, 500k
. eststo: xi: xtivreg2  lpop (jewspresentDummy=lnIV500k_exp) i.year i.year*cereal5
> 0k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   if Jewis
> hCity==1 & year>1300,fe robust ffirst
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
Warning - singleton groups detected.  9 observation(s) not used.
Warning - duplicate variables detected
Duplicates:    _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750 _Iyear_1800
               _Iyear_1850
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  1,  2360)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2360)
jewspresentD |      11.17    0.0008 |       11.34   0.0008 |       11.17

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=11.22    P-val=0.0008

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      10.92
Kleibergen-Paap Wald rk F statistic                                11.17

Stock-Yogo weak ID test critical values for K1=1 and L1=1:
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(1,2360)=      3.58     P-val=0.0587
Anderson-Rubin Wald test           Chi-sq(1)=      3.63     P-val=0.0566
Stock-Wright LM S statistic        Chi-sq(1)=      3.67     P-val=0.0554

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         37
Number of endogenous regressors      K1 =          1
Number of instruments                L  =         37
Number of excluded instruments       L1 =          1

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 37,  2360) =    23.42
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =   0.1109
Total (uncentered) SS   =   1080.04002                Uncentered R2 =   0.1109
Residual SS             =  960.2948464                Root MSE      =    .6329

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |  -.7547195   .5032591    -1.50   0.134    -1.741089    .2316503
    _Iyear_1500 |  -.4315248   .7406461    -0.58   0.560    -1.883164    1.020115
    _Iyear_1600 |   .3351549   .6186592     0.54   0.588    -.8773948    1.547705
    _Iyear_1700 |   .3384042   .6060891     0.56   0.577    -.8495087    1.526317
    _Iyear_1750 |   .6063439   .5489258     1.10   0.269     -.469531    1.682219
    _Iyear_1800 |   .9359283   .5283996     1.77   0.077    -.0997159    1.971573
    _Iyear_1850 |   1.201841   .5529195     2.17   0.030     .1181389    2.285543
 _IyeaXcer_1500 |    .078441   .1433788     0.55   0.584    -.2025763    .3594584
 _IyeaXcer_1600 |   -.041459   .1179671    -0.35   0.725    -.2726702    .1897523
 _IyeaXcer_1700 |  -.0131342   .1143778    -0.11   0.909    -.2373105    .2110421
 _IyeaXcer_1750 |  -.0030519   .1106729    -0.03   0.978    -.2199668    .2138631
 _IyeaXcer_1800 |   .0003102   .1105024     0.00   0.998    -.2162706     .216891
 _IyeaXcer_1850 |   .0592249   .1185871     0.50   0.617    -.1732016    .2916514
 _IyeaXuni_1500 |  -.0305255   .2033751    -0.15   0.881    -.4291334    .3680823
 _IyeaXuni_1600 |    .017573   .1848393     0.10   0.924    -.3447052    .3798513
 _IyeaXuni_1700 |  -.2515624   .1888144    -1.33   0.183    -.6216318     .118507
 _IyeaXuni_1750 |  -.3437026   .1880765    -1.83   0.068    -.7123258    .0249205
 _IyeaXuni_1800 |  -.3971134   .1775474    -2.24   0.025    -.7450998    -.049127
 _IyeaXuni_1850 |  -.4758336   .1962788    -2.42   0.015     -.860533   -.0911341
 _IyeaXDAn_1500 |   8.40e-07   5.64e-07     1.49   0.136    -2.64e-07    1.94e-06
 _IyeaXDAn_1600 |  -3.36e-07   5.52e-07    -0.61   0.542    -1.42e-06    7.45e-07
 _IyeaXDAn_1700 |  -1.07e-06   4.78e-07    -2.24   0.025    -2.00e-06   -1.32e-07
 _IyeaXDAn_1750 |  -1.19e-06   5.55e-07    -2.14   0.033    -2.28e-06   -9.87e-08
 _IyeaXDAn_1800 |  -1.57e-06   5.69e-07    -2.76   0.006    -2.69e-06   -4.55e-07
 _IyeaXDAn_1850 |  -1.26e-06   5.33e-07    -2.36   0.018    -2.30e-06   -2.15e-07
 _IyeaXDRi_1500 |   7.20e-07   1.66e-06     0.43   0.665    -2.54e-06    3.98e-06
 _IyeaXDRi_1600 |  -1.75e-07   1.53e-06    -0.11   0.909    -3.17e-06    2.82e-06
 _IyeaXDRi_1700 |   9.93e-08   1.53e-06     0.06   0.948    -2.91e-06    3.10e-06
 _IyeaXDRi_1750 |   6.54e-07   1.47e-06     0.45   0.656    -2.23e-06    3.53e-06
 _IyeaXDRi_1800 |   5.22e-07   1.52e-06     0.34   0.731    -2.46e-06    3.50e-06
 _IyeaXDRi_1850 |   4.29e-07   1.60e-06     0.27   0.788    -2.70e-06    3.56e-06
 _IyeaXDMe_1500 |   8.84e-07   1.17e-06     0.75   0.450    -1.41e-06    3.18e-06
 _IyeaXDMe_1600 |   8.67e-07   1.03e-06     0.85   0.398    -1.14e-06    2.88e-06
 _IyeaXDMe_1700 |   5.34e-07   1.01e-06     0.53   0.598    -1.45e-06    2.52e-06
 _IyeaXDMe_1750 |  -1.09e-08   1.10e-06    -0.01   0.992    -2.16e-06    2.14e-06
 _IyeaXDMe_1800 |  -4.97e-07   1.14e-06    -0.44   0.663    -2.74e-06    1.74e-06
 _IyeaXDMe_1850 |  -1.09e-06   1.29e-06    -0.84   0.400    -3.62e-06    1.45e-06
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             11.224
                                                   Chi-sq(1) P-val =    0.0008
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               10.918
                         (Kleibergen-Paap rk Wald F statistic):         11.166
Stock-Yogo weak ID test critical values: 10% maximal IV size             16.38
                                         15% maximal IV size              8.96
                                         20% maximal IV size              6.66
                                         25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850
Excluded instruments: lnIV500k_exp
Duplicates:           _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy )  star(* 0.10 ** 0.05 *** 0.0
> 1)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y        2.777***       -0.755   
                  (0.918)         (0.503)   
--------------------------------------------
N                    2889            2889   
r2                 -1.265           0.111   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. 
. 
. 
. 
. ************************************************************************
. * Table 3: Robustness
. ************************************************************************
. 
. 
. *reg: potato, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   i.year*potato50k 
> if JewishCity==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
i.year*pota~50k   _IyeaXpot_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds    i.year*potato50k
> , fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
i.year*pota~50k   _IyeaXpot_#         (coded as above)
(est2 stored)

. *reg: potato, iv
. eststo: quietly: xi:  xtivreg2 lpop (jewspresentDummy=lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      
>   i.year*potato50k if JewishCity==1, fe robust ffirst
(est3 stored)

. eststo: quietly: xi:  xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.yea
> r*cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds  
>   i.year*potato50k if JewishCity==1, fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.347***        0.301***        0.578***        0.993***
                 (0.0450)        (0.0426)        (0.0858)         (0.365)   
----------------------------------------------------------------------------
N                    2898            8440            2889            2889   
r2                  0.479           0.453           0.465           0.366   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *reg: Dummy for 10km of Atlantic Coast, ols
. gen DAtlantic10k=0

. replace DAtlantic10k=1 if  DAtlantic<=10000
(728 real changes made)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   i.year*DAtlantic1
> 0k if JewishCity==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
i.year*DAtl~10k   _IyeaXDAt_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds    i.year*DAtlantic
> 10k, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
i.year*DAtl~10k   _IyeaXDAt_#         (coded as above)
(est2 stored)

. *reg: Dummy for 10km of Atlantic Coast, iv
. eststo: quietly: xi:  xtivreg2 lpop (jewspresentDummy=lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      
>   i.year*DAtlantic10k if JewishCity==1, fe robust ffirst
(est3 stored)

. eststo: quietly: xi:  xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.yea
> r*cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds  
>   i.year*DAtlantic10k if JewishCity==1, fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.341***        0.292***        0.456***        0.839***
                 (0.0464)        (0.0431)        (0.0696)         (0.233)   
----------------------------------------------------------------------------
N                    2898            8440            2889            2889   
r2                  0.478           0.455           0.474           0.405   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. 
. *reg: MA, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   i.year*DAnySeas  
> i.year*DRivers i.year*DMedRds i.year*IV_MA    if JewishCity==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
i.year*DAnySeas   _IyeaXDAna#         (coded as above)
i.year*DRivers    _IyeaXDRia#         (coded as above)
i.year*DMedRds    _IyeaXDMea#         (coded as above)
i.year*IV_MA      _IyeaXIV__#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   i.year*DAnySeas  
> i.year*DRivers i.year*DMedRds i.year*IV_MA  , fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
i.year*DAnySeas   _IyeaXDAna#         (coded as above)
i.year*DRivers    _IyeaXDRia#         (coded as above)
i.year*DMedRds    _IyeaXDMea#         (coded as above)
i.year*IV_MA      _IyeaXIV__#         (coded as above)
(est2 stored)

. *reg: MA, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds    i.
> year*DAnySeas  i.year*DRivers i.year*DMedRds i.year*IV_MA  if JewishCity==1, fe 
> robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
> i.year*DAnySeas  i.year*DRivers i.year*DMedRds i.year*IV_MA  if JewishCity==1, f
> e robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.275***        0.237***        0.242***        0.672** 
                 (0.0455)        (0.0418)        (0.0865)         (0.296)   
----------------------------------------------------------------------------
N                    2898            8440            2889            2889   
r2                  0.499           0.478           0.499           0.456   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *reg: persecutions, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      i.year*persecu
> tions if JewishCity==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
i.year*persec~s   _IyeaXper_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      i.year*persecu
> tions, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
i.year*persec~s   _IyeaXper_#         (coded as above)
(est2 stored)

. *reg: persecutions, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      
>  i.year*persecutions if JewishCity==1, fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>     i.year*persecutions if JewishCity==1, fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.383***        0.370***        0.586***        1.675** 
                 (0.0512)        (0.0509)        (0.0943)         (0.784)   
----------------------------------------------------------------------------
N                    2898            8440            2889            2889   
r2                  0.475           0.448           0.465          0.0938   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *reg: BD mortality, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds       i.year*mortal
> ity263 if JewishCity==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
i.year*mort~263   _IyeaXmor_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds       i.year*mortal
> ity263, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
i.year*mort~263   _IyeaXmor_#         (coded as above)
(est2 stored)

. *reg: BD mortality, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      
>  i.year*mortality263 if JewishCity==1, fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>      i.year*mortality263 if JewishCity==1, fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.353***        0.311***        0.529***        0.989***
                 (0.0457)        (0.0432)        (0.0782)         (0.325)   
----------------------------------------------------------------------------
N                    2898            8440            2889            2889   
r2                  0.472           0.447           0.464           0.359   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *reg: continuous years, ols
. eststo: xi: quietly: xtreg  lpop jewspresentYears i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds       if JewishCity
> ==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentYears i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      , fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: continuous years, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentYears=lnIV100k) i.year i.year*cer
> eal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      i
> f JewishCity==1, fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentYears=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>      if JewishCity==1, fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentYears   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~s      0.00405***      0.00356***      0.00586***      0.00977***
               (0.000507)      (0.000476)      (0.000828)       (0.00297)   
----------------------------------------------------------------------------
N                    2898            8440            2889            2889   
r2                  0.476           0.448           0.468           0.394   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *reg: 1200 sample, ols
. 
. ************************************************************************
. * THIS REQUIRES THE DATA TO BE RELOADED WITH THE PRE-1400 VALUES
. ************************************************************************
. 
. ************************************************************************
. * THE RELOADING BEGINS HERE
. ************************************************************************
. 
. 
. clear

. set matsize 10000

. use "/Users/Noel Johnson Notebook/Desktop/Dropbox/Research/Jews City Growth/Data
> /Analysis/Base Jewish Cities Data 12-29-15.dta", replace

. sort Bairoch_id year

. 
. * Drop the 5 cities that are in the middle of nowhere (and out of frame in the g
> is file) *
. 
. * Bergen
. drop if Bairoch_id==1648
(0 observations deleted)

. *Trondheim
. drop if Bairoch_id==1656
(0 observations deleted)

. *Ponta-Delgada
. drop if Bairoch_id==1805
(0 observations deleted)

. *Falun
. drop if Bairoch_id==2078
(0 observations deleted)

. *Gaevle
. drop if Bairoch_id==2079
(0 observations deleted)

. 
. xtset Bairoch_id year
       panel variable:  Bairoch_id (strongly balanced)
        time variable:  year, 800 to 1850, but with gaps
                delta:  1 unit

. 
. 
. *************************************************
. * Create Some Variables *
. *************************************************
. 
. by Bairoch_id: egen meanjewspresentdummy=mean(jewspresentDummy)

. gen JewishCity=0

. replace JewishCity=1 if  meanjewspresentdummy>0
(6513 real changes made)

. label var JewishCity "=1 if city ever has a Jewish community"

. drop  meanjewspresentdummy

. 
. sort Bairoch_id year

. by Bairoch_id: gen lag1pop=pop[_n-1]
(15618 missing values generated)

. gen lngrowth= ln(pop/lag1pop)
(15738 missing values generated)

. gen  lag1lnpop =ln(lag1pop)
(15622 missing values generated)

. 
. sort Bairoch_id year

. gen altpop=pop
(13923 missing values generated)

. replace altpop=.5 if pop==.
(13923 real changes made)

. replace altpop=.5 if pop==0
(4 real changes made)

. by Bairoch_id: gen altlag1pop=altpop[_n-1]
(1792 missing values generated)

. gen altlngrowth= ln(altpop/altlag1pop)
(1792 missing values generated)

. gen alt  =ln(altlag1pop)
(1792 missing values generated)

. gen laltpop=ln(altpop)

. 
. sort Bairoch_id year

. by Bairoch_id: gen lag1popB=pop_bairoch[_n-1]
(15637 missing values generated)

. gen lngrowthB= ln(pop_bairoch/lag1popB)
(15757 missing values generated)

. gen   Blag1lnpop=ln(lag1popB)
(15641 missing values generated)

. 
. gen lpop=ln(pop)
(13927 missing values generated)

. gen lnpopB = ln(pop_bairoch)
(13946 missing values generated)

. 
. *create sample variables to hold constant the city samples over time
. 
. sort  Bairoch_id year

. gen growthexist1400=.
(23296 missing values generated)

. replace growthexist1400=1 if (lpop~=. & year==1400)
(572 real changes made)

. replace growthexist1400=1 if (lpop~=. & year==1500)
(768 real changes made)

. replace growthexist1400=1 if (lpop~=. & year==1600)
(1033 real changes made)

. replace growthexist1400=1 if (lpop~=. & year==1700)
(1272 real changes made)

. replace growthexist1400=1 if (lpop~=. & year==1750)
(1357 real changes made)

. replace growthexist1400=1 if (lpop~=. & year==1800)
(1743 real changes made)

. replace growthexist1400=1 if (lpop~=. & year==1850)
(1695 real changes made)

. by Bairoch_id: egen temp=sum(growthexist1400)

. replace growthexist1400=1 if temp==7
(3300 real changes made)

. replace growthexist1400=0 if temp<7 
(16146 real changes made)

. drop temp

. 
. sort  Bairoch_id year

. gen growthexist1500=.
(23296 missing values generated)

. replace growthexist1500=1 if (lpop~=. & year==1500)
(768 real changes made)

. replace growthexist1500=1 if (lpop~=. & year==1600)
(1033 real changes made)

. replace growthexist1500=1 if (lpop~=. & year==1700)
(1272 real changes made)

. replace growthexist1500=1 if (lpop~=. & year==1750)
(1357 real changes made)

. replace growthexist1500=1 if (lpop~=. & year==1800)
(1743 real changes made)

. replace growthexist1500=1 if (lpop~=. & year==1850)
(1695 real changes made)

. by Bairoch_id: egen temp=sum(growthexist1500)

. replace growthexist1500=1 if temp==6
(5194 real changes made)

. replace growthexist1500=0 if temp<6 
(13650 real changes made)

. drop temp

. 
. 
. sort  Bairoch_id year

. gen growthexist1600=.
(23296 missing values generated)

. replace growthexist1600=1 if (lpop~=. & year==1600)
(1033 real changes made)

. replace growthexist1600=1 if (lpop~=. & year==1700)
(1272 real changes made)

. replace growthexist1600=1 if (lpop~=. & year==1750)
(1357 real changes made)

. replace growthexist1600=1 if (lpop~=. & year==1800)
(1743 real changes made)

. replace growthexist1600=1 if (lpop~=. & year==1850)
(1695 real changes made)

. by Bairoch_id: egen temp=sum(growthexist1600)

. replace growthexist1600=1 if temp==5
(7968 real changes made)

. replace growthexist1600=0 if temp<5 
(10348 real changes made)

. drop temp

. 
. 
. sort  Bairoch_id year

. gen growthexist1700=.
(23296 missing values generated)

. replace growthexist1700=1 if (lpop~=. & year==1700)
(1272 real changes made)

. replace growthexist1700=1 if (lpop~=. & year==1750)
(1357 real changes made)

. replace growthexist1700=1 if (lpop~=. & year==1800)
(1743 real changes made)

. replace growthexist1700=1 if (lpop~=. & year==1850)
(1695 real changes made)

. by Bairoch_id: egen temp=sum(growthexist1700)

. replace growthexist1700=1 if temp==4
(11043 real changes made)

. replace growthexist1700=0 if temp<4 
(7345 real changes made)

. drop temp

. 
. 
. 
. *import the instruments
. *expulsion iv
. sort  Bairoch_id year

. merge m:m Bairoch_id year using "/Users/Noel Johnson Notebook/Desktop/Dropbox/Re
> search/Jews City Growth/Replication Files JDE Johnson_Koyama/IV/jewishcityivs_Co
> 1_Expulsion.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                            54
        from master                         0  (_merge==1)
        from using                         54  (_merge==2)

    matched                            23,296  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. rename NA1_1 IV0k_exp

. rename NA1_9 IV50k_exp

. rename NA1_3 IV100k_exp

. rename NA1_4 IV250k_exp

. rename NA1_8 IV500k_exp

. rename NA1_7 IV_MA

. 
. 
. gen lnIV0k_exp = ln(IV0k_exp)
(7177 missing values generated)

. gen lnIV50k_exp = ln(IV50k_exp)
(7177 missing values generated)

. gen lnIV100k_exp = ln(IV100k_exp)
(7177 missing values generated)

. gen lnIV250k_exp = ln(IV250k_exp)
(7177 missing values generated)

. gen lnIV500k_exp = ln(IV500k_exp)
(7177 missing values generated)

. gen lnIV_MA=ln(IV_MA)
(7177 missing values generated)

. 
. *non-expulsion iv
. sort  Bairoch_id year

. merge m:m Bairoch_id year using "/Users/Noel Johnson Notebook/Desktop/Dropbox/Re
> search/Jews City Growth/Replication Files JDE Johnson_Koyama/IV/jewishcityivs_Co
> 1.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                            23,350  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. rename NA1_1 IV0k

. rename NA1_9 IV50k

. rename NA1_3 IV100k

. rename NA1_4 IV250k

. rename NA1_8 IV500k

. drop NA1_7

. 
. gen lnIV0k = ln(IV0k)
(7177 missing values generated)

. gen lnIV50k = ln(IV50k)
(7177 missing values generated)

. gen lnIV100k = ln(IV100k)
(7177 missing values generated)

. gen lnIV250k = ln(IV250k)
(7177 missing values generated)

. gen lnIV500k = ln(IV500k)
(7177 missing values generated)

. 
. *Fix 1850 coding mistakes
. 
. replace jewspresentDummy=1 if city_jjk=="HALBERSTADT" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="HEIDELBERG" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="SCHWERIN" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="WISMAR" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="ROVIGO" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="LUENENBERG" & year==1850
(0 real changes made)

. replace jewspresentDummy=1 if city_jjk=="OLDENBERG" & year==1850
(0 real changes made)

. replace jewspresentDummy=1 if city_jjk=="PASSAU" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="LUGO" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="NARBONNE" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="IPSWICH" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="SUNDERLAND" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="PITIGLIANO" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="GUESTROW" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="ROSTOCK" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="ALKMAAR" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="AMERSFOORT" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="GRONINGEN" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="HAARLEM" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="LEEUWARDEN" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="ROTTERDAM" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="SGRAVENHAGUE" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="WORKUM" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="ZWOLLE" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="NYSA" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="WARSZAWA" & year==1850
(1 real change made)

. replace jewspresentDummy=1 if city_jjk=="OSTRAVA" & year==1850
(1 real change made)

. 
. drop if year<1200
(7168 observations deleted)

. 
. order  city_jjk Bairoch_id year JewishCity jewspresentDummy jewspresentYears per
> secutions expulsion pogrom lpop lngrowth    pop_bairoch pop countryname

. 
. ************************************************************************
. * THE RELOADING ENDS HERE
. ************************************************************************
. 
. 
. 
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds       if JewishCity
> ==1, fe robust
i.year            _Iyear_1200-1850    (naturally coded; _Iyear_1200 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds     , fe robust
i.year            _Iyear_1200-1850    (naturally coded; _Iyear_1200 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: lpopBairoch, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds    if
>  JewishCity==1, fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>   if JewishCity==1, fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.356***        0.306***        0.540***        0.252   
                 (0.0486)        (0.0447)        (0.0644)         (0.214)   
----------------------------------------------------------------------------
N                    3282            9080            3274            3274   
r2                  0.430           0.424           0.420           0.426   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. drop if year<1400
(3596 observations deleted)

. 
. 
. 
. *reg: solow specification
. eststo: xi: quietly: reg  lngrowth jewspresentDummy i.year i.year*cereal50k i.ye
> ar*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds    lag1lnpop     
>  if JewishCity==1,  robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: reg  lngrowth jewspresentDummy i.year i.year*cereal50k i.ye
> ar*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds    lag1lnpop   , 
> robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: solow specification, iv
. eststo: quietly: xi: ivreg2  lngrowth (jewspresentDummy =lnIV100k) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>   lag1lnpop   if JewishCity==1, robust ffirst
(est3 stored)

. eststo: quietly: xi: ivreg2  lngrowth (jewspresentDummy=lnIV100k_exp) i.year i.y
> ear*cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds
>       lag1lnpop   if JewishCity==1,  robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                 lngrowth        lngrowth        lngrowth        lngrowth   
----------------------------------------------------------------------------
jewspresen~y       0.0866***        0.155***        0.371***        0.429***
                 (0.0182)        (0.0151)        (0.0594)        (0.0876)   
----------------------------------------------------------------------------
N                    2647            7101            2647            2647   
r2                  0.206           0.209           0.130          0.0963   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *reg: assume cities not in sample have population of 500
. eststo: xi: quietly: xtreg  laltpop jewspresentDummy i.year i.year*cereal50k i.y
> ear*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds     if JewishCit
> y==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  laltpop jewspresentDummy i.year i.year*cereal50k i.y
> ear*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   , fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: assume cities not in sample have population of 500, iv
. eststo: quietly: xi: xtivreg2  laltpop (jewspresentDummy =lnIV100k) i.year i.yea
> r*cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds  
>    if JewishCity==1, fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2  laltpop (jewspresentDummy=lnIV100k_exp) i.year i.
> year*cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRd
> s      if JewishCity==1, fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy)  star(* 0.10 ** 0.05 *** 0.01
> )

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                  laltpop         laltpop         laltpop         laltpop   
----------------------------------------------------------------------------
jewspresen~y        0.368***        0.320***        0.562***        0.632*  
                 (0.0460)        (0.0432)        (0.0773)         (0.329)   
----------------------------------------------------------------------------
N                    3507           12544            3507            3507   
r2                  0.499           0.553           0.493           0.488   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *reg: cluster se modern country, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds     if JewishCity==
> 1, fe cluster(countryname)
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds     , fe cluster(co
> untryname)
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: cluster se modern country, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      
> if JewishCity==1, fe cluster(countryname) ffirst
Warning: estimated covariance matrix of moment conditions not of full rank.
         model tests should be interpreted with caution.
Possible causes:
         number of clusters insufficient to calculate robust covariance matrix
         singleton dummy variable (dummy with one 1 and N-1 0s or vice versa)
partial option may address problem.
Warning: estimated covariance matrix of moment conditions not of full rank.
         model tests should be interpreted with caution.
Possible causes:
         number of clusters insufficient to calculate robust covariance matrix
         singleton dummy variable (dummy with one 1 and N-1 0s or vice versa)
partial option may address problem.
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>    if JewishCity==1, fe cluster(countryname) ffirst
Warning: estimated covariance matrix of moment conditions not of full rank.
         model tests should be interpreted with caution.
Possible causes:
         number of clusters insufficient to calculate robust covariance matrix
         singleton dummy variable (dummy with one 1 and N-1 0s or vice versa)
partial option may address problem.
Warning: estimated covariance matrix of moment conditions not of full rank.
         model tests should be interpreted with caution.
Possible causes:
         number of clusters insufficient to calculate robust covariance matrix
         singleton dummy variable (dummy with one 1 and N-1 0s or vice versa)
partial option may address problem.
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.350**         0.302**         0.491**         0.864** 
                  (0.124)         (0.109)         (0.216)         (0.394)   
----------------------------------------------------------------------------
N                    2898            8440            2889            2889   
r2                  0.471           0.445           0.465           0.393   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. *reg: cities exist 1400, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      if JewishCity=
> =1  & growthexist1400==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds     if  growthexist
> 1400==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: cities exist 1400, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      
> if JewishCity==1 & growthexist1400==1, fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>    if JewishCity==1 & growthexist1400==1, fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.353***        0.307***        0.439***        1.078***
                 (0.0538)        (0.0505)        (0.0801)         (0.366)   
----------------------------------------------------------------------------
N                    1953            3850            1953            1953   
r2                  0.475           0.475           0.473           0.309   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. *reg: cities exist 1500, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      if JewishCity=
> =1 & growthexist1500==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      if  growthexis
> t1500==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: cities exist 1500, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      
> if JewishCity==1 & growthexist1500==1, fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>     if JewishCity==1 & growthexist1500==1, fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.355***        0.307***        0.459***        0.912***
                 (0.0493)        (0.0465)        (0.0678)         (0.259)   
----------------------------------------------------------------------------
N                    2349            5002            2349            2349   
r2                  0.475           0.461           0.472           0.378   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. *reg: cities exist 1600, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds        if JewishCit
> y==1 & growthexist1600==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds       if  growthexi
> st1600==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: cities exist 1600, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      
>  if JewishCity==1 & growthexist1600==1, fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>      if JewishCity==1 & growthexist1600==1, fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.356***        0.314***        0.495***        0.957***
                 (0.0481)        (0.0454)        (0.0686)         (0.280)   
----------------------------------------------------------------------------
N                    2564            6272            2564            2564   
r2                  0.472           0.448           0.466           0.364   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. *reg: cities exist 1700, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds       if JewishCity
> ==1 & growthexist1700==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds        if  growthex
> ist1700==1, fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: cities exist 1700, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      
> if JewishCity==1 & growthexist1700==1, fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>     if JewishCity==1 & growthexist1700==1, fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.363***        0.313***        0.495***        0.959***
                 (0.0470)        (0.0443)        (0.0692)         (0.284)   
----------------------------------------------------------------------------
N                    2694            7201            2694            2694   
r2                  0.474           0.454           0.469           0.371   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. *reg: exclude UK, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds     if JewishCity==
> 1 & countryname~="United Kingdom", fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      if  countrynam
> e~="United Kingdom", fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: exclude UK, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds     i
> f JewishCity==1 & countryname~="United Kingdom", fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>   if JewishCity==1 & countryname~="United Kingdom", fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.228***        0.188***        0.196**         0.570** 
                 (0.0438)        (0.0383)        (0.0836)         (0.239)   
----------------------------------------------------------------------------
N                    2652            7636            2643            2643   
r2                  0.426           0.410           0.425           0.386   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *reg: exclude Netherlands, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds     if JewishCity==
> 1 & countryname~="The Netherlands", fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      if  countrynam
> e~="The Netherlands", fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: exclude Netherlands, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      
> if JewishCity==1 & countryname~="The Netherlands", fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>    if JewishCity==1 & countryname~="The Netherlands", fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.355***        0.299***        0.542***        1.061***
                 (0.0464)        (0.0435)        (0.0802)         (0.318)   
----------------------------------------------------------------------------
N                    2835            8128            2826            2826   
r2                  0.470           0.450           0.460           0.330   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *reg: exclude France, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds       if JewishCity
> ==1 & countryname~="France", fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds       if  countryna
> me~="France", fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: exclude France, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      
> if JewishCity==1 & countryname~="France", fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>   if JewishCity==1 & countryname~="France", fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.399***        0.344***        0.627***        1.023***
                 (0.0536)        (0.0502)        (0.0725)         (0.274)   
----------------------------------------------------------------------------
N                    2349            6960            2340            2340   
r2                  0.467           0.460           0.453           0.358   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *reg: exclude Germany, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds       if JewishCity
> ==1 & countryname~="Germany", fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds       if  countryna
> me~="Germany", fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: exclude Germany, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds     i
> f JewishCity==1 & countryname~="Germany", fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>    if JewishCity==1 & countryname~="Germany", fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.426***        0.351***        0.540***        0.694***
                 (0.0521)        (0.0499)        (0.0656)         (0.199)   
----------------------------------------------------------------------------
N                    2199            7111            2191            2191   
r2                  0.499           0.454           0.495           0.477   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. *reg: exclude Italy, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds       if JewishCity
> ==1 & countryname~="Italy", fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds        if  countryn
> ame~="Italy", fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: exclude Italy, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      
>   if JewishCity==1 & countryname~="Italy", fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>     if JewishCity==1 & countryname~="Italy", fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.337***        0.307***        0.432***        0.878***
                 (0.0509)        (0.0490)        (0.0843)         (0.272)   
----------------------------------------------------------------------------
N                    2428            6641            2422            2422   
r2                  0.489           0.452           0.487           0.413   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *reg: exclude Spain, ols
. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      if JewishCity=
> =1 & countryname~="Spain", fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. eststo: xi: quietly: xtreg  lpop jewspresentDummy i.year i.year*cereal50k i.year
> *university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds       if  countryna
> me~="Spain", fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. *reg: exclude Spain, iv
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy =lnIV100k) i.year i.year*ce
> real50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds      
>  if JewishCity==1 & countryname~="Spain", fe robust ffirst
(est3 stored)

. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy=lnIV100k_exp) i.year i.year
> *cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
>   if JewishCity==1 & countryname~="Spain", fe robust ffirst
(est4 stored)

. esttab, replace se scalars(r2) k(jewspresentDummy   )  star(* 0.10 ** 0.05 *** 0
> .01)

----------------------------------------------------------------------------
                      (1)             (2)             (3)             (4)   
                     lpop            lpop            lpop            lpop   
----------------------------------------------------------------------------
jewspresen~y        0.307***        0.272***        0.485***        1.112** 
                 (0.0437)        (0.0425)        (0.0777)         (0.436)   
----------------------------------------------------------------------------
N                    2527            7239            2518            2518   
r2                  0.508           0.477           0.499           0.321   
----------------------------------------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. 
. ****************************************************
. * Table 4:  Flexible Regressions 
. ****************************************************
. 
. * Reg 1: lpop fe base sample
. xi: quietly: xtreg  lpop i.year*jewspresentDummy i.year i.year*cereal50k i.year*
> university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   if JewishCity==1 &
>  year>1300, fe  robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*jewspr~y   _IyeaXjew_#         (coded as above)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)

. 
. lincom jewspresentDummy + _IyeaXjew_1500

 ( 1)  jewspresentDummy + _IyeaXjew_1500 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3823104   .0735979     5.19   0.000     .2377112    .5269097
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1600

 ( 1)  jewspresentDummy + _IyeaXjew_1600 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1896545   .0557199     3.40   0.001     .0801805    .2991285
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1700

 ( 1)  jewspresentDummy + _IyeaXjew_1700 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1890798   .0592529     3.19   0.002     .0726645    .3054951
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1750

 ( 1)  jewspresentDummy + _IyeaXjew_1750 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2019979    .053959     3.74   0.000     .0959836    .3080121
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1800

 ( 1)  jewspresentDummy + _IyeaXjew_1800 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3166494   .0611172     5.18   0.000     .1965713    .4367275
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1850

 ( 1)  jewspresentDummy + _IyeaXjew_1850 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5532718   .0718678     7.70   0.000     .4120718    .6944718
------------------------------------------------------------------------------

. 
. 
. xi i.year*jewspresentDummy i.year*lnIV100k i.year*lnIV100k_exp i.year*cereal50k 
> i.year*university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*jewspr~y   _IyeaXjew_#         (coded as above)
i.year*lnIV100k   _IyeaXlnI_#         (coded as above)
i.year*lnIV10~p   _IyeaXlnIa#         (coded as above)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)

. 
. *Reg 2: lpop fe iv100k base sample
. xtivreg2  lpop (jewspresentDummy _IyeaXjew_1500 _IyeaXjew_1600 _IyeaXjew_1700 _I
> yeaXjew_1750 _IyeaXjew_1800 _IyeaXjew_1850 = lnIV100k _IyeaXlnI_1500 _IyeaXlnI_1
> 600 _IyeaXlnI_1700 _IyeaXlnI_1750 _IyeaXlnI_1800 _IyeaXlnI_1850) _Iyear_1500 _Iy
> ear_1600  _Iyear_1700 _Iyear_1750 _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXc
> er_1600 _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800 _IyeaXcer_1850 _IyeaXuni_15
> 00 _IyeaXuni_1600 _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800 _IyeaXuni_1850 _I
> yeaXDAn_1500 _IyeaXDAn_1600 _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800 _IyeaXD
> An_1850 _IyeaXDRi_1500 _IyeaXDRi_1600 _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_18
> 00 _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600 _IyeaXDMe_1700 _IyeaXDMe_1750 _I
> yeaXDMe_1800 _IyeaXDMe_1850  cereal50k university  DAnySeas DRivers DMedRds  if 
> JewishCity==1 & year>1300 , fe robust ffirst
Warning - singleton groups detected.  9 observation(s) not used.
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  7,  2354)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2354)
jewspresentD |      88.58    0.0000 |        8.35   0.0039 |        8.20
_IyeaXjew_15 |      14.28    0.0000 |       13.01   0.0003 |       12.78
_IyeaXjew_16 |      19.68    0.0000 |       40.61   0.0000 |       39.88
_IyeaXjew_17 |       8.47    0.0000 |       30.32   0.0000 |       29.77
_IyeaXjew_17 |      15.97    0.0000 |       42.12   0.0000 |       41.37
_IyeaXjew_18 |      17.87    0.0000 |       42.42   0.0000 |       41.66
_IyeaXjew_18 |      34.40    0.0000 |       54.85   0.0000 |       53.86

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                    5% maximal IV relative bias    19.86
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=44.59    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                      10.72
Kleibergen-Paap Wald rk F statistic                                 7.10

Stock-Yogo weak ID test critical values for K1=7 and L1=7:
                                                               <not available>
Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(7,2354)=     14.13     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(7)=    100.73     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(7)=     86.06     P-val=0.0000

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         43
Number of endogenous regressors      K1 =          7
Number of instruments                L  =         43
Number of excluded instruments       L1 =          7

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 43,  2354) =    31.64
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =   0.3846
Total (uncentered) SS   =   1080.04002                Uncentered R2 =   0.3846
Residual SS             =  664.6688068                Root MSE      =    .5266

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |   .7849474    .662237     1.19   0.236    -.5130132    2.082908
 _IyeaXjew_1500 |  -.7047318   .7934084    -0.89   0.374    -2.259784      .85032
 _IyeaXjew_1600 |  -.7209573   .7794615    -0.92   0.355    -2.248674    .8067592
 _IyeaXjew_1700 |   .2137652   .8827727     0.24   0.809    -1.516438    1.943968
 _IyeaXjew_1750 |   -.186449   .8046785    -0.23   0.817     -1.76359    1.390692
 _IyeaXjew_1800 |   .2058885   .8034042     0.26   0.798    -1.368755    1.780532
 _IyeaXjew_1850 |   .4509939   .7811666     0.58   0.564    -1.080064    1.982052
    _Iyear_1500 |   .9025579   .5995906     1.51   0.132    -.2726181    2.077734
    _Iyear_1600 |   1.425558   .6144918     2.32   0.020     .2211764     2.62994
    _Iyear_1700 |   1.331102    .611054     2.18   0.029     .1334577    2.528745
    _Iyear_1750 |   1.346734     .62111     2.17   0.030      .129381    2.564088
    _Iyear_1800 |   1.297206   .6446466     2.01   0.044     .0337221     2.56069
    _Iyear_1850 |   1.510199   .6439237     2.35   0.019     .2481321    2.772267
 _IyeaXcer_1500 |  -.0559485   .0937247    -0.60   0.551    -.2396455    .1277485
 _IyeaXcer_1600 |  -.1173157    .081715    -1.44   0.151    -.2774741    .0428427
 _IyeaXcer_1700 |   -.120716   .0805106    -1.50   0.134    -.2785139    .0370819
 _IyeaXcer_1750 |  -.0659209   .0751604    -0.88   0.380    -.2132326    .0813909
 _IyeaXcer_1800 |  -.0402178   .0780012    -0.52   0.606    -.1930973    .1126616
 _IyeaXcer_1850 |  -.0407295   .0809968    -0.50   0.615    -.1994804    .1180213
 _IyeaXuni_1500 |   -.031749   .1755041    -0.18   0.856    -.3757308    .3122328
 _IyeaXuni_1600 |   .0718644   .1771571     0.41   0.685    -.2753571    .4190859
 _IyeaXuni_1700 |   .0380841   .1714987     0.22   0.824    -.2980473    .3742154
 _IyeaXuni_1750 |  -.0793044   .1585784    -0.50   0.617    -.3901124    .2315037
 _IyeaXuni_1800 |  -.2216332   .1716088    -1.29   0.197    -.5579802    .1147138
 _IyeaXuni_1850 |  -.3284261   .1864155    -1.76   0.078    -.6937937    .0369415
 _IyeaXDAn_1500 |   8.08e-07   7.58e-07     1.07   0.286    -6.77e-07    2.29e-06
 _IyeaXDAn_1600 |   7.19e-07   6.00e-07     1.20   0.231    -4.57e-07    1.90e-06
 _IyeaXDAn_1700 |  -6.25e-07   6.63e-07    -0.94   0.346    -1.92e-06    6.74e-07
 _IyeaXDAn_1750 |  -9.99e-08   5.80e-07    -0.17   0.863    -1.24e-06    1.04e-06
 _IyeaXDAn_1800 |  -5.79e-07   5.88e-07    -0.98   0.325    -1.73e-06    5.74e-07
 _IyeaXDAn_1850 |  -8.56e-07   6.33e-07    -1.35   0.177    -2.10e-06    3.85e-07
 _IyeaXDRi_1500 |   2.32e-07   1.08e-06     0.22   0.829    -1.88e-06    2.34e-06
 _IyeaXDRi_1600 |   1.74e-07   1.02e-06     0.17   0.864    -1.82e-06    2.16e-06
 _IyeaXDRi_1700 |   1.53e-06   1.06e-06     1.45   0.147    -5.40e-07    3.61e-06
 _IyeaXDRi_1750 |   5.77e-07   9.71e-07     0.59   0.552    -1.33e-06    2.48e-06
 _IyeaXDRi_1800 |   8.87e-07   1.00e-06     0.89   0.376    -1.08e-06    2.85e-06
 _IyeaXDRi_1850 |   9.20e-07   1.08e-06     0.85   0.395    -1.20e-06    3.04e-06
 _IyeaXDMe_1500 |   6.95e-07   8.48e-07     0.82   0.412    -9.67e-07    2.36e-06
 _IyeaXDMe_1600 |   1.46e-06   7.73e-07     1.88   0.060    -5.89e-08    2.97e-06
 _IyeaXDMe_1700 |   1.11e-06   7.78e-07     1.43   0.153    -4.14e-07    2.64e-06
 _IyeaXDMe_1750 |   1.35e-06   7.51e-07     1.80   0.072    -1.19e-07    2.83e-06
 _IyeaXDMe_1800 |   1.02e-06   7.88e-07     1.30   0.195    -5.24e-07    2.56e-06
 _IyeaXDMe_1850 |   1.10e-06   8.57e-07     1.29   0.198    -5.76e-07    2.78e-06
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             44.588
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):               10.720
                         (Kleibergen-Paap rk Wald F statistic):          7.100
Stock-Yogo weak ID test critical values:                       <not available>
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy _IyeaXjew_1500 _IyeaXjew_1600
                      _IyeaXjew_1700 _IyeaXjew_1750 _IyeaXjew_1800
                      _IyeaXjew_1850
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850
Excluded instruments: lnIV100k _IyeaXlnI_1500 _IyeaXlnI_1600 _IyeaXlnI_1700
                      _IyeaXlnI_1750 _IyeaXlnI_1800 _IyeaXlnI_1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------

. 
. lincom jewspresentDummy + _IyeaXjew_1500

 ( 1)  jewspresentDummy + _IyeaXjew_1500 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0802156   .3076606     0.26   0.794     -.522788    .6832193
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1600

 ( 1)  jewspresentDummy + _IyeaXjew_1600 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .0639902   .2079289     0.31   0.758     -.343543    .4715233
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1700

 ( 1)  jewspresentDummy + _IyeaXjew_1700 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9987126   .3415812     2.92   0.003     .3292257      1.6682
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1750

 ( 1)  jewspresentDummy + _IyeaXjew_1750 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5984984   .2218151     2.70   0.007     .1637487    1.033248
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1800

 ( 1)  jewspresentDummy + _IyeaXjew_1800 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .9908359   .2310371     4.29   0.000     .5380115     1.44366
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1850

 ( 1)  jewspresentDummy + _IyeaXjew_1850 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.235941   .2046705     6.04   0.000     .8347945    1.637088
------------------------------------------------------------------------------

. 
. 
. *Reg 3: lpop fe iv100k_exp base sample
. xtivreg2  lpop (jewspresentDummy _IyeaXjew_1500 _IyeaXjew_1600 _IyeaXjew_1700 _I
> yeaXjew_1750 _IyeaXjew_1800 _IyeaXjew_1850 = lnIV100k_exp _IyeaXlnIa1500 _IyeaXl
> nIa1600 _IyeaXlnIa1700 _IyeaXlnIa1750 _IyeaXlnIa1800 _IyeaXlnIa1850) _Iyear_1500
>  _Iyear_1600 _Iyear_1700 _Iyear_1750 _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _Iye
> aXcer_1600 _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800 _IyeaXcer_1850 _IyeaXuni
> _1500 _IyeaXuni_1600 _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800 _IyeaXuni_1850
>  _IyeaXDAn_1500 _IyeaXDAn_1600 _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800 _Iye
> aXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600 _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi
> _1800 _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600 _IyeaXDMe_1700 _IyeaXDMe_1750
>  _IyeaXDMe_1800 _IyeaXDMe_1850  cereal50k university DAnySeas DRivers DMedRds  i
> f JewishCity==1 & year>1300 , fe robust ffirst
Warning - singleton groups detected.  9 observation(s) not used.
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  7,  2354)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2354)
jewspresentD |       7.84    0.0000 |        0.87   0.3512 |        0.85
_IyeaXjew_15 |       7.89    0.0000 |       44.24   0.0000 |       43.45
_IyeaXjew_16 |      21.16    0.0000 |       21.20   0.0000 |       20.82
_IyeaXjew_17 |       8.85    0.0000 |       10.19   0.0014 |       10.01
_IyeaXjew_17 |       9.74    0.0000 |        5.11   0.0237 |        5.02
_IyeaXjew_18 |       9.40    0.0000 |        4.06   0.0440 |        3.99
_IyeaXjew_18 |      12.12    0.0000 |        1.67   0.1962 |        1.64

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                    5% maximal IV relative bias    19.86
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=3.92     P-val=0.0476

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                       1.33
Kleibergen-Paap Wald rk F statistic                                 0.53

Stock-Yogo weak ID test critical values for K1=7 and L1=7:
                                                               <not available>
Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(7,2354)=      5.44     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(7)=     38.76     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(7)=     33.31     P-val=0.0000

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         43
Number of endogenous regressors      K1 =          7
Number of instruments                L  =         43
Number of excluded instruments       L1 =          7

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 43,  2354) =    17.94
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =  -0.1308
Total (uncentered) SS   =   1080.04002                Uncentered R2 =  -0.1308
Residual SS             =  1221.283941                Root MSE      =    .7138

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |  -1.758635   2.150456    -0.82   0.413    -5.973452    2.456182
 _IyeaXjew_1500 |   .7853081   1.408076     0.56   0.577     -1.97447    3.545086
 _IyeaXjew_1600 |   2.114833   2.157662     0.98   0.327    -2.114107    6.343772
 _IyeaXjew_1700 |    3.63667    2.55058     1.43   0.154    -1.362375    8.635715
 _IyeaXjew_1750 |   3.045797   2.351102     1.30   0.195    -1.562279    7.653873
 _IyeaXjew_1800 |   3.552396   2.534367     1.40   0.161    -1.414873    8.519664
 _IyeaXjew_1850 |   3.837642   2.664956     1.44   0.150    -1.385576    9.060861
    _Iyear_1500 |  -1.364762   2.001118    -0.68   0.495    -5.286882    2.557357
    _Iyear_1600 |  -.7000678   1.846346    -0.38   0.705    -4.318838    2.918703
    _Iyear_1700 |  -.8468492   1.880655    -0.45   0.652    -4.532866    2.839167
    _Iyear_1750 |  -.9629232   1.888954    -0.51   0.610    -4.665204    2.739358
    _Iyear_1800 |  -1.160613    1.99945    -0.58   0.562    -5.079463    2.758237
    _Iyear_1850 |   -.955224   2.044757    -0.47   0.640    -4.962874    3.052426
 _IyeaXcer_1500 |   .1434686   .2259672     0.63   0.525    -.2994191    .5863562
 _IyeaXcer_1600 |  -.0692462   .1277175    -0.54   0.588     -.319568    .1810755
 _IyeaXcer_1700 |  -.0978076   .1209027    -0.81   0.419    -.3347725    .1391573
 _IyeaXcer_1750 |  -.0205218   .1167293    -0.18   0.860     -.249307    .2082633
 _IyeaXcer_1800 |   .0162277    .119596     0.14   0.892    -.2181761    .2506316
 _IyeaXcer_1850 |  -.0054093   .1198292    -0.05   0.964    -.2402703    .2294517
 _IyeaXuni_1500 |  -.1297148   .2616356    -0.50   0.620    -.6425112    .3830816
 _IyeaXuni_1600 |  -.2247967    .301472    -0.75   0.456    -.8156708    .3660775
 _IyeaXuni_1700 |  -.1532148   .3046019    -0.50   0.615    -.7502236    .4437941
 _IyeaXuni_1750 |  -.2820862   .2873774    -0.98   0.326    -.8453355    .2811631
 _IyeaXuni_1800 |  -.4714291   .3084416    -1.53   0.126    -1.075964    .1331054
 _IyeaXuni_1850 |  -.5911934   .3291926    -1.80   0.073    -1.236399    .0540123
 _IyeaXDAn_1500 |   4.84e-07   9.70e-07     0.50   0.617    -1.42e-06    2.39e-06
 _IyeaXDAn_1600 |  -8.29e-07   1.34e-06    -0.62   0.536    -3.45e-06    1.80e-06
 _IyeaXDAn_1700 |  -2.51e-06   1.52e-06    -1.65   0.098    -5.49e-06    4.66e-07
 _IyeaXDAn_1750 |  -1.66e-06   1.35e-06    -1.24   0.216    -4.30e-06    9.72e-07
 _IyeaXDAn_1800 |  -2.18e-06   1.39e-06    -1.57   0.117    -4.91e-06    5.47e-07
 _IyeaXDAn_1850 |  -2.71e-06   1.57e-06    -1.72   0.085    -5.79e-06    3.70e-07
 _IyeaXDRi_1500 |   4.66e-07   1.60e-06     0.29   0.771    -2.68e-06    3.61e-06
 _IyeaXDRi_1600 |   5.21e-07   1.54e-06     0.34   0.735    -2.50e-06    3.54e-06
 _IyeaXDRi_1700 |   2.57e-06   1.71e-06     1.51   0.132    -7.75e-07    5.92e-06
 _IyeaXDRi_1750 |   8.56e-07   1.48e-06     0.58   0.564    -2.05e-06    3.76e-06
 _IyeaXDRi_1800 |   1.34e-06   1.52e-06     0.88   0.377    -1.64e-06    4.32e-06
 _IyeaXDRi_1850 |   1.40e-06   1.60e-06     0.87   0.383    -1.74e-06    4.53e-06
 _IyeaXDMe_1500 |   1.07e-06   1.26e-06     0.85   0.395    -1.40e-06    3.54e-06
 _IyeaXDMe_1600 |   1.08e-06   1.15e-06     0.94   0.349    -1.18e-06    3.34e-06
 _IyeaXDMe_1700 |   7.01e-07   1.18e-06     0.60   0.551    -1.61e-06    3.01e-06
 _IyeaXDMe_1750 |   1.35e-06   1.13e-06     1.19   0.234    -8.72e-07    3.57e-06
 _IyeaXDMe_1800 |   1.06e-06   1.14e-06     0.94   0.350    -1.16e-06    3.29e-06
 _IyeaXDMe_1850 |   1.39e-06   1.28e-06     1.09   0.276    -1.12e-06    3.90e-06
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):              3.923
                                                   Chi-sq(1) P-val =    0.0476
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                1.327
                         (Kleibergen-Paap rk Wald F statistic):          0.530
Stock-Yogo weak ID test critical values:                       <not available>
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy _IyeaXjew_1500 _IyeaXjew_1600
                      _IyeaXjew_1700 _IyeaXjew_1750 _IyeaXjew_1800
                      _IyeaXjew_1850
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850
Excluded instruments: lnIV100k_exp _IyeaXlnIa1500 _IyeaXlnIa1600 _IyeaXlnIa1700
                      _IyeaXlnIa1750 _IyeaXlnIa1800 _IyeaXlnIa1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------

. 
. lincom jewspresentDummy + _IyeaXjew_1500

 ( 1)  jewspresentDummy + _IyeaXjew_1500 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.9733268    1.14665    -0.85   0.396    -3.220719    1.274066
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1600

 ( 1)  jewspresentDummy + _IyeaXjew_1600 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3561977   .3082678     1.16   0.248    -.2479961    .9603916
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1700

 ( 1)  jewspresentDummy + _IyeaXjew_1700 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.878035   .6626148     2.83   0.005     .5793339    3.176736
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1750

 ( 1)  jewspresentDummy + _IyeaXjew_1750 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.287162   .4881019     2.64   0.008     .3304999    2.243824
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1800

 ( 1)  jewspresentDummy + _IyeaXjew_1800 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.793761   .6130774     2.93   0.003     .5921513     2.99537
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1850

 ( 1)  jewspresentDummy + _IyeaXjew_1850 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   2.079007   .7914965     2.63   0.009     .5277028    3.630312
------------------------------------------------------------------------------

. 
. 
. *Reg 4: lpop fe iv100k base sample control for market access
. xtivreg2  lpop (jewspresentDummy _IyeaXjew_1500 _IyeaXjew_1600 _IyeaXjew_1700 _I
> yeaXjew_1750 _IyeaXjew_1800 _IyeaXjew_1850 = lnIV100k _IyeaXlnI_1500 _IyeaXlnI_1
> 600 _IyeaXlnI_1700 _IyeaXlnI_1750 _IyeaXlnI_1800 _IyeaXlnI_1850) _Iyear_1500 _Iy
> ear_1600  _Iyear_1700 _Iyear_1750 _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXc
> er_1600 _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800 _IyeaXcer_1850 _IyeaXuni_15
> 00 _IyeaXuni_1600 _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800 _IyeaXuni_1850 _I
> yeaXDAn_1500 _IyeaXDAn_1600 _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800 _IyeaXD
> An_1850 _IyeaXDRi_1500 _IyeaXDRi_1600 _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_18
> 00 _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600 _IyeaXDMe_1700 _IyeaXDMe_1750 _I
> yeaXDMe_1800 _IyeaXDMe_1850  cereal50k university  DAnySeas DRivers DMedRds IV_M
> A if JewishCity==1 & year>1300 , fe robust ffirst
Warning - singleton groups detected.  9 observation(s) not used.
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  7,  2353)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2353)
jewspresentD |      73.46    0.0000 |        8.25   0.0041 |        8.10
_IyeaXjew_15 |      14.39    0.0000 |       13.16   0.0003 |       12.92
_IyeaXjew_16 |      20.12    0.0000 |       39.33   0.0000 |       38.61
_IyeaXjew_17 |       9.62    0.0000 |       27.91   0.0000 |       27.39
_IyeaXjew_17 |      17.05    0.0000 |       39.92   0.0000 |       39.19
_IyeaXjew_18 |      17.93    0.0000 |       41.71   0.0000 |       40.94
_IyeaXjew_18 |      34.22    0.0000 |       43.42   0.0000 |       42.62

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                    5% maximal IV relative bias    19.86
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=44.17    P-val=0.0000

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                       9.63
Kleibergen-Paap Wald rk F statistic                                 6.91

Stock-Yogo weak ID test critical values for K1=7 and L1=7:
                                                               <not available>
Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(7,2353)=      6.41     P-val=0.0000
Anderson-Rubin Wald test           Chi-sq(7)=     45.72     P-val=0.0000
Stock-Wright LM S statistic        Chi-sq(7)=     38.99     P-val=0.0000

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         44
Number of endogenous regressors      K1 =          7
Number of instruments                L  =         44
Number of excluded instruments       L1 =          7

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 44,  2353) =    35.12
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =   0.4395
Total (uncentered) SS   =   1080.04002                Uncentered R2 =   0.4395
Residual SS             =  605.3094965                Root MSE      =    .5025

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |   1.018952   .6767838     1.51   0.132    -.3075197    2.345424
 _IyeaXjew_1500 |  -.8896978    .802509    -1.11   0.268    -2.462586    .6831909
 _IyeaXjew_1600 |  -1.070911   .8032557    -1.33   0.182    -2.645264    .5034409
 _IyeaXjew_1700 |  -.2306849   .9140953    -0.25   0.801    -2.022279    1.560909
 _IyeaXjew_1750 |  -.5971653    .832937    -0.72   0.473    -2.229692    1.035361
 _IyeaXjew_1800 |  -.2725452   .8350672    -0.33   0.744    -1.909247    1.364156
 _IyeaXjew_1850 |  -.2887553   .8310711    -0.35   0.728    -1.917625    1.340114
    _Iyear_1500 |   1.074601   .6149926     1.75   0.081    -.1307621    2.279965
    _Iyear_1600 |   1.557873   .6239759     2.50   0.013     .3349025    2.780843
    _Iyear_1700 |    1.42494   .6192309     2.30   0.021     .2112693     2.63861
    _Iyear_1750 |   1.417331   .6322919     2.24   0.025     .1780616      2.6566
    _Iyear_1800 |   1.333845   .6527349     2.04   0.041     .0545076    2.613181
    _Iyear_1850 |   1.266033    .650306     1.95   0.052    -.0085438    2.540609
 _IyeaXcer_1500 |  -.0671806     .09628    -0.70   0.485    -.2558859    .1215248
 _IyeaXcer_1600 |  -.1167441   .0827831    -1.41   0.158    -.2789959    .0455077
 _IyeaXcer_1700 |  -.1144354    .081658    -1.40   0.161    -.2744821    .0456112
 _IyeaXcer_1750 |  -.0628772    .077029    -0.82   0.414    -.2138512    .0880968
 _IyeaXcer_1800 |  -.0424487   .0793176    -0.54   0.593    -.1979082    .1130109
 _IyeaXcer_1850 |  -.0057913   .0822891    -0.07   0.944    -.1670751    .1554924
 _IyeaXuni_1500 |  -.0104342   .1771854    -0.06   0.953    -.3577112    .3368427
 _IyeaXuni_1600 |   .1123016   .1821507     0.62   0.538    -.2447072    .4693105
 _IyeaXuni_1700 |   .0490833   .1711152     0.29   0.774    -.2862963     .384463
 _IyeaXuni_1750 |  -.0620262   .1614982    -0.38   0.701    -.3785569    .2545046
 _IyeaXuni_1800 |  -.1969642   .1704647    -1.16   0.248    -.5310689    .1371405
 _IyeaXuni_1850 |  -.2220527   .1767773    -1.26   0.209    -.5685298    .1244244
 _IyeaXDAn_1500 |   9.20e-07   7.73e-07     1.19   0.234    -5.95e-07    2.44e-06
 _IyeaXDAn_1600 |   9.43e-07   6.24e-07     1.51   0.131    -2.81e-07    2.17e-06
 _IyeaXDAn_1700 |  -2.93e-07   6.94e-07    -0.42   0.673    -1.65e-06    1.07e-06
 _IyeaXDAn_1750 |   2.16e-07   6.10e-07     0.35   0.723    -9.79e-07    1.41e-06
 _IyeaXDAn_1800 |  -1.09e-07   6.27e-07    -0.17   0.862    -1.34e-06    1.12e-06
 _IyeaXDAn_1850 |   2.58e-07   7.21e-07     0.36   0.720    -1.15e-06    1.67e-06
 _IyeaXDRi_1500 |   2.54e-07   1.10e-06     0.23   0.818    -1.91e-06    2.42e-06
 _IyeaXDRi_1600 |   1.01e-07   1.03e-06     0.10   0.922    -1.92e-06    2.13e-06
 _IyeaXDRi_1700 |   1.35e-06   1.07e-06     1.26   0.207    -7.49e-07    3.45e-06
 _IyeaXDRi_1750 |   5.69e-07   9.90e-07     0.57   0.565    -1.37e-06    2.51e-06
 _IyeaXDRi_1800 |   8.77e-07   1.02e-06     0.86   0.390    -1.12e-06    2.88e-06
 _IyeaXDRi_1850 |   1.10e-06   1.09e-06     1.01   0.314    -1.04e-06    3.24e-06
 _IyeaXDMe_1500 |   5.85e-07   8.60e-07     0.68   0.496    -1.10e-06    2.27e-06
 _IyeaXDMe_1600 |   1.26e-06   7.87e-07     1.60   0.110    -2.85e-07    2.80e-06
 _IyeaXDMe_1700 |   8.60e-07   7.87e-07     1.09   0.274    -6.82e-07    2.40e-06
 _IyeaXDMe_1750 |   9.94e-07   7.72e-07     1.29   0.198    -5.19e-07    2.51e-06
 _IyeaXDMe_1800 |   5.12e-07   8.16e-07     0.63   0.530    -1.09e-06    2.11e-06
 _IyeaXDMe_1850 |   3.88e-07   8.92e-07     0.43   0.664    -1.36e-06    2.14e-06
          IV_MA |   .0002211   .0000675     3.27   0.001     .0000888    .0003535
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):             44.168
                                                   Chi-sq(1) P-val =    0.0000
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                9.632
                         (Kleibergen-Paap rk Wald F statistic):          6.913
Stock-Yogo weak ID test critical values:                       <not available>
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy _IyeaXjew_1500 _IyeaXjew_1600
                      _IyeaXjew_1700 _IyeaXjew_1750 _IyeaXjew_1800
                      _IyeaXjew_1850
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850 IV_MA
Excluded instruments: lnIV100k _IyeaXlnI_1500 _IyeaXlnI_1600 _IyeaXlnI_1700
                      _IyeaXlnI_1750 _IyeaXlnI_1800 _IyeaXlnI_1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------

. 
. lincom jewspresentDummy + _IyeaXjew_1500

 ( 1)  jewspresentDummy + _IyeaXjew_1500 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1292545   .3016248     0.43   0.668    -.4619193    .7204282
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1600

 ( 1)  jewspresentDummy + _IyeaXjew_1600 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.0519591   .2157826    -0.24   0.810    -.4748852     .370967
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1700

 ( 1)  jewspresentDummy + _IyeaXjew_1700 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7882673   .3554749     2.22   0.027     .0915493    1.484985
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1750

 ( 1)  jewspresentDummy + _IyeaXjew_1750 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .4217869   .2363874     1.78   0.074    -.0415239    .8850978
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1800

 ( 1)  jewspresentDummy + _IyeaXjew_1800 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |    .746407    .250859     2.98   0.003     .2547324    1.238082
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1850

 ( 1)  jewspresentDummy + _IyeaXjew_1850 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .7301969   .2610159     2.80   0.005     .2186151    1.241779
------------------------------------------------------------------------------

. 
. 
. *Reg 5: lpop fe iv100k_exp base sample control for market access
. xtivreg2  lpop (jewspresentDummy _IyeaXjew_1500 _IyeaXjew_1600 _IyeaXjew_1700 _I
> yeaXjew_1750 _IyeaXjew_1800 _IyeaXjew_1850 = lnIV100k_exp _IyeaXlnIa1500 _IyeaXl
> nIa1600 _IyeaXlnIa1700 _IyeaXlnIa1750 _IyeaXlnIa1800 _IyeaXlnIa1850) _Iyear_1500
>  _Iyear_1600 _Iyear_1700 _Iyear_1750 _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _Iye
> aXcer_1600 _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800 _IyeaXcer_1850 _IyeaXuni
> _1500 _IyeaXuni_1600 _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800 _IyeaXuni_1850
>  _IyeaXDAn_1500 _IyeaXDAn_1600 _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800 _Iye
> aXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600 _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi
> _1800 _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600 _IyeaXDMe_1700 _IyeaXDMe_1750
>  _IyeaXDMe_1800 _IyeaXDMe_1850  cereal50k university DAnySeas DRivers DMedRds IV
> _MA if JewishCity==1 & year>1300 , fe robust ffirst
Warning - singleton groups detected.  9 observation(s) not used.
Warning - collinearities detected
Vars dropped:  cereal50k university DAnySeas DRivers DMedRds

FIXED EFFECTS ESTIMATION
------------------------
Number of groups =       492                    Obs per group: min =         2
                                                               avg =       5.9
                                                               max =         7


Summary results for first-stage regressions
-------------------------------------------

                                           (Underid)            (Weak id)
Variable     | F(  7,  2353)  P-val | AP Chi-sq(  1) P-val | AP F(  1,  2353)
jewspresentD |       7.88    0.0000 |        0.87   0.3517 |        0.85
_IyeaXjew_15 |       8.63    0.0000 |       42.40   0.0000 |       41.63
_IyeaXjew_16 |      21.97    0.0000 |       21.29   0.0000 |       20.90
_IyeaXjew_17 |       9.11    0.0000 |       10.01   0.0016 |        9.83
_IyeaXjew_17 |       9.71    0.0000 |        5.06   0.0245 |        4.97
_IyeaXjew_18 |       9.26    0.0000 |        3.99   0.0457 |        3.92
_IyeaXjew_18 |      12.30    0.0000 |        1.43   0.2322 |        1.40

NB: first-stage test statistics heteroskedasticity-robust

Stock-Yogo weak ID test critical values for single endogenous regressor:
                                    5% maximal IV relative bias    19.86
                                   10% maximal IV size             16.38
                                   15% maximal IV size              8.96
                                   20% maximal IV size              6.66
                                   25% maximal IV size              5.53
Source: Stock-Yogo (2005).  Reproduced by permission.
NB: Critical values are for Cragg-Donald F statistic and i.i.d. errors.

Underidentification test
Ho: matrix of reduced form coefficients has rank=K1-1 (underidentified)
Ha: matrix has rank=K1 (identified)
Kleibergen-Paap rk LM statistic          Chi-sq(1)=4.52     P-val=0.0335

Weak identification test
Ho: equation is weakly identified
Cragg-Donald Wald F statistic                                       1.35
Kleibergen-Paap Wald rk F statistic                                 0.61

Stock-Yogo weak ID test critical values for K1=7 and L1=7:
                                                               <not available>
Weak-instrument-robust inference
Tests of joint significance of endogenous regressors B1 in main equation
Ho: B1=0 and orthogonality conditions are valid
Anderson-Rubin Wald test           F(7,2353)=      3.58     P-val=0.0008
Anderson-Rubin Wald test           Chi-sq(7)=     25.55     P-val=0.0006
Stock-Wright LM S statistic        Chi-sq(7)=     23.60     P-val=0.0013

NB: Underidentification, weak identification and weak-identification-robust
    test statistics heteroskedasticity-robust

Number of observations               N  =       2889
Number of regressors                 K  =         44
Number of endogenous regressors      K1 =          7
Number of instruments                L  =         44
Number of excluded instruments       L1 =          7

IV (2SLS) estimation
--------------------

Estimates efficient for homoskedasticity only
Statistics robust to heteroskedasticity

                                                      Number of obs =     2889
                                                      F( 44,  2353) =    20.59
                                                      Prob > F      =   0.0000
Total (centered) SS     =   1080.04002                Centered R2   =   0.0027
Total (uncentered) SS   =   1080.04002                Uncentered R2 =   0.0027
Residual SS             =   1077.15896                Root MSE      =    .6704

---------------------------------------------------------------------------------
                |               Robust
           lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
----------------+----------------------------------------------------------------
jewspresentDu~y |  -1.878753   2.148683    -0.87   0.382    -6.090095    2.332589
 _IyeaXjew_1500 |   1.105418   1.490027     0.74   0.458     -1.81498    4.025817
 _IyeaXjew_1600 |   2.135087   2.093861     1.02   0.308    -1.968804    6.238979
 _IyeaXjew_1700 |    3.54693   2.426671     1.46   0.144    -1.209257    8.303117
 _IyeaXjew_1750 |   2.966738   2.245705     1.32   0.186    -1.434763     7.36824
 _IyeaXjew_1800 |   3.423821   2.412044     1.42   0.156    -1.303699     8.15134
 _IyeaXjew_1850 |   3.564635   2.503476     1.42   0.154    -1.342087    8.471358
    _Iyear_1500 |  -1.446459   1.992511    -0.73   0.468    -5.351709    2.458792
    _Iyear_1600 |  -.8426235   1.860034    -0.45   0.651    -4.488223    2.802976
    _Iyear_1700 |  -1.018351    1.89857    -0.54   0.592     -4.73948    2.702778
    _Iyear_1750 |  -1.139797    1.89774    -0.60   0.548    -4.859299    2.579704
    _Iyear_1800 |  -1.361559   2.001148    -0.68   0.496    -5.283737    2.560619
    _Iyear_1850 |  -1.416568    2.10674    -0.67   0.501    -5.545702    2.712566
 _IyeaXcer_1500 |   .1201889   .2129035     0.56   0.572    -.2970942     .537472
 _IyeaXcer_1600 |  -.0618559   .1311677    -0.47   0.637      -.31894    .1952281
 _IyeaXcer_1700 |   -.084104   .1261061    -0.67   0.505    -.3312675    .1630595
 _IyeaXcer_1750 |   -.009853   .1219646    -0.08   0.936    -.2488992    .2291931
 _IyeaXcer_1800 |   .0217136   .1224798     0.18   0.859    -.2183424    .2617696
 _IyeaXcer_1850 |   .0291472   .1309936     0.22   0.824    -.2275955    .2858898
 _IyeaXuni_1500 |  -.1689611   .2547542    -0.66   0.507    -.6682702    .3303479
 _IyeaXuni_1600 |  -.2221788   .2944528    -0.75   0.451    -.7992958    .3549382
 _IyeaXuni_1700 |   -.178378   .3075091    -0.58   0.562    -.7810849    .4243288
 _IyeaXuni_1750 |   -.303637   .2919434    -1.04   0.298    -.8758356    .2685616
 _IyeaXuni_1800 |   -.483109   .3041565    -1.59   0.112    -1.079245    .1130268
 _IyeaXuni_1850 |  -.5359287   .3072731    -1.74   0.081    -1.138173    .0663154
 _IyeaXDAn_1500 |   1.93e-07   9.29e-07     0.21   0.835    -1.63e-06    2.01e-06
 _IyeaXDAn_1600 |  -8.38e-07   1.30e-06    -0.64   0.519    -3.39e-06    1.71e-06
 _IyeaXDAn_1700 |  -2.42e-06   1.44e-06    -1.68   0.093    -5.23e-06    4.02e-07
 _IyeaXDAn_1750 |  -1.59e-06   1.29e-06    -1.23   0.217    -4.12e-06    9.34e-07
 _IyeaXDAn_1800 |  -1.98e-06   1.31e-06    -1.51   0.130    -4.54e-06    5.83e-07
 _IyeaXDAn_1850 |  -2.01e-06   1.48e-06    -1.36   0.175    -4.90e-06    8.92e-07
 _IyeaXDRi_1500 |   5.06e-07   1.65e-06     0.31   0.759    -2.73e-06    3.74e-06
 _IyeaXDRi_1600 |   4.96e-07   1.60e-06     0.31   0.756    -2.64e-06    3.63e-06
 _IyeaXDRi_1700 |   2.42e-06   1.74e-06     1.39   0.163    -9.83e-07    5.83e-06
 _IyeaXDRi_1750 |   8.73e-07   1.56e-06     0.56   0.575    -2.18e-06    3.92e-06
 _IyeaXDRi_1800 |   1.34e-06   1.58e-06     0.85   0.396    -1.76e-06    4.45e-06
 _IyeaXDRi_1850 |   1.60e-06   1.66e-06     0.96   0.335    -1.65e-06    4.85e-06
 _IyeaXDMe_1500 |   7.90e-07   1.24e-06     0.64   0.523    -1.63e-06    3.21e-06
 _IyeaXDMe_1600 |   8.51e-07   1.22e-06     0.70   0.484    -1.53e-06    3.24e-06
 _IyeaXDMe_1700 |   4.30e-07   1.25e-06     0.34   0.731    -2.02e-06    2.88e-06
 _IyeaXDMe_1750 |   9.58e-07   1.28e-06     0.75   0.455    -1.56e-06    3.47e-06
 _IyeaXDMe_1800 |   5.55e-07   1.31e-06     0.42   0.672    -2.01e-06    3.12e-06
 _IyeaXDMe_1850 |   7.49e-07   1.52e-06     0.49   0.622    -2.23e-06    3.73e-06
          IV_MA |   .0001823   .0001473     1.24   0.216    -.0001064     .000471
---------------------------------------------------------------------------------
Underidentification test (Kleibergen-Paap rk LM statistic):              4.521
                                                   Chi-sq(1) P-val =    0.0335
------------------------------------------------------------------------------
Weak identification test (Cragg-Donald Wald F statistic):                1.350
                         (Kleibergen-Paap rk Wald F statistic):          0.609
Stock-Yogo weak ID test critical values:                       <not available>
------------------------------------------------------------------------------
Hansen J statistic (overidentification test of all instruments):         0.000
                                                 (equation exactly identified)
------------------------------------------------------------------------------
Instrumented:         jewspresentDummy _IyeaXjew_1500 _IyeaXjew_1600
                      _IyeaXjew_1700 _IyeaXjew_1750 _IyeaXjew_1800
                      _IyeaXjew_1850
Included instruments: _Iyear_1500 _Iyear_1600 _Iyear_1700 _Iyear_1750
                      _Iyear_1800 _Iyear_1850 _IyeaXcer_1500 _IyeaXcer_1600
                      _IyeaXcer_1700 _IyeaXcer_1750 _IyeaXcer_1800
                      _IyeaXcer_1850 _IyeaXuni_1500 _IyeaXuni_1600
                      _IyeaXuni_1700 _IyeaXuni_1750 _IyeaXuni_1800
                      _IyeaXuni_1850 _IyeaXDAn_1500 _IyeaXDAn_1600
                      _IyeaXDAn_1700 _IyeaXDAn_1750 _IyeaXDAn_1800
                      _IyeaXDAn_1850 _IyeaXDRi_1500 _IyeaXDRi_1600
                      _IyeaXDRi_1700 _IyeaXDRi_1750 _IyeaXDRi_1800
                      _IyeaXDRi_1850 _IyeaXDMe_1500 _IyeaXDMe_1600
                      _IyeaXDMe_1700 _IyeaXDMe_1750 _IyeaXDMe_1800
                      _IyeaXDMe_1850 IV_MA
Excluded instruments: lnIV100k_exp _IyeaXlnIa1500 _IyeaXlnIa1600 _IyeaXlnIa1700
                      _IyeaXlnIa1750 _IyeaXlnIa1800 _IyeaXlnIa1850
Dropped collinear:    cereal50k university DAnySeas DRivers DMedRds
------------------------------------------------------------------------------

. 
. lincom jewspresentDummy + _IyeaXjew_1500

 ( 1)  jewspresentDummy + _IyeaXjew_1500 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |  -.7733349    1.01719    -0.76   0.447    -2.766992    1.220322
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1600

 ( 1)  jewspresentDummy + _IyeaXjew_1600 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2563341   .3383278     0.76   0.449    -.4067763    .9194445
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1700

 ( 1)  jewspresentDummy + _IyeaXjew_1700 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.668177   .6621233     2.52   0.012     .3704387    2.965914
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1750

 ( 1)  jewspresentDummy + _IyeaXjew_1750 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.087985   .5301403     2.05   0.040     .0489289    2.127041
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1800

 ( 1)  jewspresentDummy + _IyeaXjew_1800 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.545067   .6188929     2.50   0.013     .3320594    2.758075
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1850

 ( 1)  jewspresentDummy + _IyeaXjew_1850 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      z    P>|z|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   1.685882   .8557833     1.97   0.049     .0085775    3.363186
------------------------------------------------------------------------------

. 
. 
. * Reg 6: lpop fe extended sample
. xi: quietly: xtreg  lpop i.year*jewspresentDummy i.year i.year*cereal50k i.year*
> university   i.year*DAnySeas  i.year*DRivers i.year*DMedRds    if  year>1300, fe
>   robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*jewspr~y   _IyeaXjew_#         (coded as above)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)

. 
. lincom jewspresentDummy + _IyeaXjew_1500

 ( 1)  jewspresentDummy + _IyeaXjew_1500 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1942224   .0518693     3.74   0.000     .0924917    .2959531
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1600

 ( 1)  jewspresentDummy + _IyeaXjew_1600 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .1741496   .0491008     3.55   0.000     .0778487    .2704505
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1700

 ( 1)  jewspresentDummy + _IyeaXjew_1700 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3110013    .062671     4.96   0.000     .1880852    .4339174
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1750

 ( 1)  jewspresentDummy + _IyeaXjew_1750 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .2788242   .0575391     4.85   0.000     .1659734     .391675
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1800

 ( 1)  jewspresentDummy + _IyeaXjew_1800 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .3575938   .0626335     5.71   0.000     .2347512    .4804363
------------------------------------------------------------------------------

. lincom jewspresentDummy + _IyeaXjew_1850

 ( 1)  jewspresentDummy + _IyeaXjew_1850 = 0

------------------------------------------------------------------------------
        lpop |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
         (1) |   .5059912    .066561     7.60   0.000     .3754458    .6365366
------------------------------------------------------------------------------

. 
. 
. ****************************************************
. *Table 5: Mechanisms Regressions
. ****************************************************
. 
. 
. 
. *Merge in some variables
. 
. *merge in the Sephardic and Hewbrew Press and Port Jew Data
. merge 1:1 Bairoch_id year using "/Users/Noel Johnson Notebook/Desktop/Dropbox/Re
> search/Jews City Growth/Replication Files JDE Johnson_Koyama/Data Sets/Sephardic
> HebrewPressData.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         3,626
        from master                        42  (_merge==1)
        from using                      3,584  (_merge==2)

    matched                            12,544  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. *merge in the emancipation Data
. merge 1:1 Bairoch_id year using "/Users/Noel Johnson Notebook/Desktop/Dropbox/Re
> search/Jews City Growth/Replication Files JDE Johnson_Koyama/Data Sets/emancipat
> ion.dta"

    Result                           # of obs.
    -----------------------------------------
    not matched                         7,210
        from master                        42  (_merge==1)
        from using                      7,168  (_merge==2)

    matched                            16,128  (_merge==3)
    -----------------------------------------

. drop _merge

. 
. *clean up Emancipation data
. replace Emancipation=0 if city_jjk=="GRAZ" & year>=1800
(2 real changes made)

. replace Emancipation=0 if city_jjk=="SALZBURG" & year==1800
(1 real change made)

. replace Emancipation=.06 if city_jjk=="SALZBURG" & year==1850
(1 real change made)

. 
. *create EmancipationAlt in which Habsburg Empire cities ==0
. gen EmancipationAlt=Emancipation
(42 missing values generated)

. replace EmancipationAlt=0 if countryname=="Austria"
(19 real changes made)

. replace EmancipationAlt=0 if countryname=="Czech Republic"
(47 real changes made)

. replace EmancipationAlt=0 if countryname=="Slovakia"
(11 real changes made)

. 
. 
. *Create interactions and clean up variables
. gen DAnySeas5km=0

. replace DAnySeas5km=1 if  DAnySeas<=5000
(2121 real changes made)

. gen JewsDummyXIV_MA = jewspresentDummy*lnIV_MA
(10794 missing values generated)

. gen lnIV100k_JewsDummyXIV_MA = lnIV100k*lnIV_MA
(10759 missing values generated)

. replace Sephardic=1 if (Sephardic>0 & Sephardic<1)
(24 real changes made)

. replace Sephardic=0 if jewspresentDummy==0
(45 real changes made)

. replace HebrewPress=1 if (HebrewPress>0 & HebrewPress<1)
(18 real changes made)

. gen jewspresentDummyXHebrewPress = jewspresentDummy*HebrewPress
(10794 missing values generated)

. gen IV100kXHebrewPress = lnIV100k*HebrewPress
(10794 missing values generated)

. gen jewspresentDummyXSephardic = jewspresentDummy*Sephardic
(10794 missing values generated)

. gen IV100kXSephardic = lnIV100k*Sephardic
(10794 missing values generated)

. gen IV_PortInteraction = lnIV100k*DAnySeas5km
(10759 missing values generated)

. gen lnIV100k_exp_JewsDummyXIV_MA = lnIV100k_exp*lnIV_MA
(10759 missing values generated)

. gen jewspresentDummyXEmancipation = jewspresentDummy*Emancipation
(10794 missing values generated)

. gen lnIV100k_JewsDummyXEmancip = lnIV100k*Emancipation
(10794 missing values generated)

. gen jewspresentDummyXEmancipatAlt = jewspresentDummy*EmancipationAlt
(10794 missing values generated)

. gen lnIV100kXEmancipatAlt = lnIV100k*EmancipationAlt
(10794 missing values generated)

. 
. 
. sum jewspresentDummy Sephardic HebrewPress PortJewInteraction Emancipation lnIV_
> MA if JewishCity==1 & lpop~=.

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
jewspresen~y |      2898    .5127674    .4999232          0          1
   Sephardic |      2898    .0448585     .207029          0          1
 HebrewPress |      2898    .0331263    .1789972          0          1
PortJewInt~n |      2898    .0269151    .1618633          0          1
Emancipation |      2898    .1456039    .3290615          0          1
-------------+--------------------------------------------------------
     lnIV_MA |      2898    6.760998    .6861903   4.848538   9.571323

. 
. 
. 
. *mechanisms table 6
. *OLS & IV100k, Base Sample
. 
. * Reg 1: Sephardic Interaction, OLS
. eststo: quietly: xi: xtreg  lpop jewspresentDummy jewspresentDummyXSephardic  i.
> year i.year*cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year
> *DMedRds    if JewishCity==1 & year>1300, fe robust
(est1 stored)

. 
. * Reg 2: Sephardic Interaction, IV
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy jewspresentDummyXSephardic 
> = lnIV100k IV100kXSephardic)  i.year i.year*cereal50k i.year*university   i.year
> *DAnySeas  i.year*DRivers i.year*DMedRds   if JewishCity==1 & year>1300, fe robu
> st
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy jewspresentDummyXSephardic)  s
> tar(* 0.10 ** 0.05 *** 0.01)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y        0.311***        0.465***
                 (0.0443)        (0.0722)   

jewspresen~c        0.482**         0.375***
                  (0.205)         (0.136)   
--------------------------------------------
N                    2898            2889   
r2                  0.477           0.471   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. * Reg 3: Hebrew Printing Press, OLS
. eststo: xi: quietly: xtreg  lpop jewspresentDummy jewspresentDummyXHebrewPress H
> ebrewPress i.year i.year*cereal50k i.year*university   i.year*DAnySeas  i.year*D
> Rivers i.year*DMedRds  if JewishCity==1 & year>1300, fe robust
i.year            _Iyear_800-1850     (naturally coded; _Iyear_800 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. 
. * Reg 4: Hebrew Printing Press, IV
. eststo: xi: quietly: xtivreg2  lpop (jewspresentDummy jewspresentDummyXHebrewPre
> ss = lnIV100k IV100kXHebrewPress) HebrewPress i.year i.year*cereal50k i.year*uni
> versity   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   if JewishCity==1 & ye
> ar>1300, fe robust
i.year            _Iyear_800-1850     (naturally coded; _Iyear_800 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy jewspresentDummyXHebrewPress H
> ebrewPress)  star(* 0.10 ** 0.05 *** 0.01)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y        0.349***        0.498***
                 (0.0457)        (0.0712)   

jewsprese~ss       -0.114          -0.571** 
                  (0.197)         (0.264)   

HebrewPress         0.518*          0.776***
                  (0.274)         (0.264)   
--------------------------------------------
N                    2898            2889   
r2                  0.474           0.466   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. * Reg 5: Ports, OLS 
. eststo: xi: quietly: xtreg  lpop jewspresentDummy PortJewInteraction DAnySeas5km
>  i.year i.year*cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.y
> ear*DMedRds    if JewishCity==1 & year>1300, fe robust
i.year            _Iyear_800-1850     (naturally coded; _Iyear_800 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. 
. * Reg 6: Ports,IV 
. eststo: xi: quietly: xtivreg2  lpop (jewspresentDummy PortJewInteraction= lnIV10
> 0k IV_PortInteraction) DAnySeas5km i.year i.year*cereal50k i.year*university   i
> .year*DAnySeas  i.year*DRivers i.year*DMedRds    if JewishCity==1 & year>1300, f
> e robust
i.year            _Iyear_800-1850     (naturally coded; _Iyear_800 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy PortJewInteraction)  star(* 0.
> 10 ** 0.05 *** 0.01)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y        0.316***        0.603***
                 (0.0464)         (0.157)   

PortJewInt~n        0.444***       -1.000   
                  (0.145)         (1.321)   
--------------------------------------------
N                    2898            2889   
r2                  0.476           0.417   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. *Reg 7: Emancipation
. eststo: quietly: xi: xtreg lpop jewspresentDummy jewspresentDummyXEmancipation E
> mancipation  i.year i.year*cereal50k i.year*university  i.year*DRR i.year*DAnySe
> as i.year*DRivers i.year*DMedRds if JewishCity==1 & year>1300,  fe robust
(est1 stored)

. 
. 
. *Reg 8: Emancipation
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy jewspresentDummyXEmancipati
> on = lnIV100k   lnIV100k_JewsDummyXEmancip ) Emancipation  i.year i.year*cereal5
> 0k i.year*university  i.year*DRR i.year*DAnySeas i.year*DRivers i.year*DMedRds i
> f JewishCity==1 & year>1300,  fe robust
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy jewspresentDummyXEmancipation 
> Emancipation)  star(* 0.10 ** 0.05 *** 0.01)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y        0.248***        0.440***
                 (0.0407)        (0.0967)   

jewspresen~n        0.332***        1.078***
                 (0.0788)         (0.394)   

Emancipation       0.0671          -0.573*  
                 (0.0627)         (0.306)   
--------------------------------------------
N                    2898            2889   
r2                  0.485           0.440   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *Reg 9: Market Access
. eststo: quietly: xi: xtreg lpop jewspresentDummy JewsDummyXIV_MA lnIV_MA  i.year
>  i.year*cereal50k i.year*university  i.year*DRR i.year*DAnySeas i.year*DRivers i
> .year*DMedRds if JewishCity==1 & year>1300,  fe robust
(est1 stored)

. 
. 
. *Reg 10: Market Access
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy JewsDummyXIV_MA = lnIV100k 
> lnIV100k_JewsDummyXIV_MA ) lnIV_MA  i.year i.year*cereal50k i.year*university  i
> .year*DRR i.year*DAnySeas i.year*DRivers i.year*DMedRds if JewishCity==1 & year>
> 1300,  fe robust
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy JewsDummyXIV_MA lnIV_MA)  star
> (* 0.10 ** 0.05 *** 0.01)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y       -0.577*         -3.523***
                  (0.299)         (0.655)   

JewsDummyX~A        0.123***        0.542***
                 (0.0450)        (0.0971)   

lnIV_MA             2.105***        2.012***
                  (0.310)         (0.294)   
--------------------------------------------
N                    2898            2889   
r2                  0.512           0.478   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. *************************************************
. *Table A2. mechanisms post-1700
. *************************************************
. 
. *OLS & IV100k, Full Sample
. 
. * 1 Sephardic Interaction, OLS
. eststo: quietly: xi: xtreg  lpop jewspresentDummy jewspresentDummyXSephardic  i.
> year i.year*cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.year
> *DMedRds    if JewishCity==1 & year>1700, fe robust
(est1 stored)

. 
. * 2 Sephardic Interaction, IV
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy jewspresentDummyXSephardic 
> = lnIV100k IV100kXSephardic)  i.year i.year*cereal50k i.year*university   i.year
> *DAnySeas  i.year*DRivers i.year*DMedRds   if JewishCity==1 & year>1700, fe robu
> st
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy jewspresentDummyXSephardic)  s
> tar(* 0.10 ** 0.05 *** 0.01)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y        0.135***        2.398***
                 (0.0513)         (0.589)   

jewspresen~c       -0.456***       -2.181***
                  (0.142)         (0.511)   
--------------------------------------------
N                    1427            1418   
r2                  0.525          -1.008   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. * 3 Hebrew Printing Press, OLS
. eststo: xi: quietly: xtreg  lpop jewspresentDummy jewspresentDummyXHebrewPress H
> ebrewPress i.year i.year*cereal50k i.year*university   i.year*DAnySeas  i.year*D
> Rivers i.year*DMedRds  if JewishCity==1 & year>1700, fe robust
i.year            _Iyear_800-1850     (naturally coded; _Iyear_800 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. 
. * 4 Hebrew Printing Press, IV
. eststo: xi: quietly: xtivreg2  lpop (jewspresentDummy jewspresentDummyXHebrewPre
> ss = lnIV100k IV100kXHebrewPress) HebrewPress i.year i.year*cereal50k i.year*uni
> versity   i.year*DAnySeas  i.year*DRivers i.year*DMedRds   if JewishCity==1 & ye
> ar>1700, fe robust
i.year            _Iyear_800-1850     (naturally coded; _Iyear_800 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy jewspresentDummyXHebrewPress) 
>  star(* 0.10 ** 0.05 *** 0.01)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y        0.123**         2.496***
                 (0.0520)         (0.640)   

jewsprese~ss      -0.0330          -0.722   
                  (0.174)         (0.814)   
--------------------------------------------
N                    1427            1418   
r2                  0.523          -1.172   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. * 5 Ports, OLS 
. eststo: xi: quietly: xtreg  lpop jewspresentDummy PortJewInteraction DAnySeas5km
>  i.year i.year*cereal50k i.year*university   i.year*DAnySeas  i.year*DRivers i.y
> ear*DMedRds    if JewishCity==1 & year>1700, fe robust
i.year            _Iyear_800-1850     (naturally coded; _Iyear_800 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est1 stored)

. 
. * 6 Ports,IV 
. eststo: xi: quietly: xtivreg2  lpop (jewspresentDummy PortJewInteraction= lnIV10
> 0k IV_PortInteraction) DAnySeas5km i.year i.year*cereal50k i.year*university   i
> .year*DAnySeas  i.year*DRivers i.year*DMedRds    if JewishCity==1 & year>1700, f
> e robust
i.year            _Iyear_800-1850     (naturally coded; _Iyear_800 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy PortJewInteraction)  star(* 0.
> 10 ** 0.05 *** 0.01)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y        0.127**         4.238   
                 (0.0504)         (3.196)   

PortJewInt~n      -0.0674          -8.560   
                  (0.148)         (12.94)   
--------------------------------------------
N                    1427            1418   
r2                  0.524          -6.598   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. *Reg 7: Emancipation post 1700
. eststo: quietly: xi: xtreg lpop jewspresentDummy jewspresentDummyXEmancipation E
> mancipation  i.year i.year*cereal50k i.year*university  i.year*DRR i.year*DAnySe
> as i.year*DRivers i.year*DMedRds if JewishCity==1 & year>1700,  fe robust
(est1 stored)

. 
. 
. *Reg 8: Emancipation post 1700
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy jewspresentDummyXEmancipati
> on = lnIV100k   lnIV100k_JewsDummyXEmancip ) Emancipation  i.year i.year*cereal5
> 0k i.year*university  i.year*DRR i.year*DAnySeas i.year*DRivers i.year*DMedRds i
> f JewishCity==1 & year>1700,  fe robust
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy jewspresentDummyXEmancipation 
> Emancipation)  star(* 0.10 ** 0.05 *** 0.01)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y      0.00739          -0.630   
                 (0.0475)         (0.842)   

jewspresen~n        0.388***        3.039***
                 (0.0732)         (0.775)   

Emancipation       -0.311***       -2.027***
                 (0.0658)         (0.499)   
--------------------------------------------
N                    1427            1418   
r2                  0.546          -0.313   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *Reg 9: Market Access
. eststo: quietly: xi: xtreg lpop jewspresentDummy JewsDummyXIV_MA lnIV_MA  i.year
>  i.year*cereal50k i.year*university  i.year*DRR i.year*DAnySeas i.year*DRivers i
> .year*DMedRds if JewishCity==1 & year>1700,  fe robust
(est1 stored)

. 
. 
. *Reg 10: Market Access
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy JewsDummyXIV_MA = lnIV100k 
> lnIV100k_JewsDummyXIV_MA ) lnIV_MA  i.year i.year*cereal50k i.year*university  i
> .year*DRR i.year*DAnySeas i.year*DRivers i.year*DMedRds if JewishCity==1 & year>
> 1700,  fe robust
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy JewsDummyXIV_MA lnIV_MA)  star
> (* 0.10 ** 0.05 *** 0.01)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y       -1.121***       -2.496*  
                  (0.423)         (1.451)   

JewsDummyX~A        0.164***        0.415***
                 (0.0577)         (0.157)   

lnIV_MA             2.520***        1.942***
                  (0.291)         (0.371)   
--------------------------------------------
N                    1427            1418   
r2                  0.622           0.544   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *************************************************
. *Table A.1 Emancipation without Habsburg Empire
. *************************************************
. 
. 
. *Reg 1: Emancipation
. eststo: quietly: xi: xtreg lpop jewspresentDummy jewspresentDummyXEmancipation E
> mancipation  i.year i.year*cereal50k i.year*university  i.year*DRR i.year*DAnySe
> as i.year*DRivers i.year*DMedRds if JewishCity==1 & year>1300,  fe robust
(est1 stored)

. 
. 
. *Reg 2: Emancipation
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy jewspresentDummyXEmancipati
> on = lnIV100k   lnIV100k_JewsDummyXEmancip ) Emancipation  i.year i.year*cereal5
> 0k i.year*university  i.year*DRR i.year*DAnySeas i.year*DRivers i.year*DMedRds i
> f JewishCity==1 & year>1300,  fe robust
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy jewspresentDummyXEmancipation 
> Emancipation)  star(* 0.10 ** 0.05 *** 0.01)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y        0.248***        0.440***
                 (0.0407)        (0.0967)   

jewspresen~n        0.332***        1.078***
                 (0.0788)         (0.394)   

Emancipation       0.0671          -0.573*  
                 (0.0627)         (0.306)   
--------------------------------------------
N                    2898            2889   
r2                  0.485           0.440   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. *Reg 3: EmancipationAlt
. eststo: quietly: xi: xtreg lpop jewspresentDummy jewspresentDummyXEmancipatAlt E
> mancipationAlt  i.year i.year*cereal50k i.year*university  i.year*DRR i.year*DAn
> ySeas i.year*DRivers i.year*DMedRds if JewishCity==1 & year>1300,  fe robust
(est1 stored)

. 
. 
. *Reg 4: EmancipationAlt
. eststo: quietly: xi: xtivreg2 lpop (jewspresentDummy jewspresentDummyXEmancipatA
> lt = lnIV100k   lnIV100kXEmancipatAlt ) EmancipationAlt  i.year i.year*cereal50k
>  i.year*university  i.year*DRR i.year*DAnySeas i.year*DRivers i.year*DMedRds if 
> JewishCity==1 & year>1300,  fe robust
(est2 stored)

. 
. esttab, replace se scalars(r2) k(jewspresentDummy jewspresentDummyXEmancipatAlt 
> EmancipationAlt)  star(* 0.10 ** 0.05 *** 0.01)

--------------------------------------------
                      (1)             (2)   
                     lpop            lpop   
--------------------------------------------
jewspresen~y        0.245***        0.405***
                 (0.0404)        (0.0967)   

jewspresen~t        0.351***        0.947***
                 (0.0845)         (0.362)   

Emancipati~t       0.0786          -0.430   
                 (0.0646)         (0.276)   
--------------------------------------------
N                    2898            2889   
r2                  0.485           0.457   
--------------------------------------------
Standard errors in parentheses
* p<0.10, ** p<0.05, *** p<0.01

. eststo clear

. 
. 
. 
. 
. 
. ********************************************************************************
> ***
. *Figure 6: data for line graph of avg MA in Jewish cities and non-Jewish cities 
> (assuming JewishCity==1)
. ********************************************************************************
> ******
. 
. drop if year<1400
(10752 observations deleted)

. 
. sort year

. by year: egen JewishmeanIV_MA=mean(lnIV_MA) if JewishCity==1 & lpop~=. & jewspre
> sentDummy==1
(11100 missing values generated)

. 
. sort year

. by year: egen NonJewishmeanIV_MA=mean(lnIV_MA) if JewishCity==1 & lpop~=. & jews
> presentDummy==0
(11174 missing values generated)

. 
. graph twoway line JewishmeanIV_MA year || line NonJewishmeanIV_MA year

. 
. sort year

. by year: sum JewishmeanIV_MA

----------------------------------------------------------------------------------
-> year = 1400

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
Jewishmean~A |       233     5.73436           0    5.73436    5.73436

----------------------------------------------------------------------------------
-> year = 1500

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
Jewishmean~A |       235    6.006397           0   6.006397   6.006397

----------------------------------------------------------------------------------
-> year = 1600

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
Jewishmean~A |       155    6.428159           0   6.428159   6.428159

----------------------------------------------------------------------------------
-> year = 1700

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
Jewishmean~A |       148    6.633495           0   6.633495   6.633495

----------------------------------------------------------------------------------
-> year = 1750

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
Jewishmean~A |       189    6.871282           0   6.871282   6.871282

----------------------------------------------------------------------------------
-> year = 1800

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
Jewishmean~A |       236    7.173576           0   7.173576   7.173576

----------------------------------------------------------------------------------
-> year = 1850

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
Jewishmean~A |       290    7.702654           0   7.702654   7.702654


. by year: sum NonJewishmeanIV_MA

----------------------------------------------------------------------------------
-> year = 1400

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
NonJewishm~A |        53    5.829234           0   5.829234   5.829234

----------------------------------------------------------------------------------
-> year = 1500

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
NonJewishm~A |       118    6.145127           0   6.145127   6.145127

----------------------------------------------------------------------------------
-> year = 1600

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
NonJewishm~A |       245    6.432684           0   6.432684   6.432684

----------------------------------------------------------------------------------
-> year = 1700

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
NonJewishm~A |       284    6.689625           0   6.689625   6.689625

----------------------------------------------------------------------------------
-> year = 1750

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
NonJewishm~A |       260    6.867217           0   6.867217   6.867217

----------------------------------------------------------------------------------
-> year = 1800

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
NonJewishm~A |       260    7.224552           0   7.224552   7.224552

----------------------------------------------------------------------------------
-> year = 1850

    Variable |       Obs        Mean    Std. Dev.       Min        Max
-------------+--------------------------------------------------------
NonJewishm~A |       192    7.648128           0   7.648128   7.648128


. 
. 
. 
. 
. 
. ********************************************************************
. *Figure 7: interaction plot for market access and jewish community OLS
. *******************************************************************
. 
. 
. xi: quietly: xtreg lpop jewspresentDummy JewsDummyXIV_MA lnIV_MA  i.year i.year*
> cereal50k i.year*university  i.year*DRR i.year*DAnySeas i.year*DRivers i.year*DM
> edRds if JewishCity==1 & year>1300,  fe robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DRR        _IyeaXDRR_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)

. 
. *************************************
. 
. generate MV=(_n)

. 
. 
. 
. replace  MV=. if _n>9.57
(12577 real changes made, 12577 to missing)

. replace  MV=. if _n<4.85
(4 real changes made, 4 to missing)

. 
. 
. *     ****************************************************************  *
. 
. *       Grab elements of the coefficient and variance-covariance matrix *
. 
. *       that are required to calculate the marginal effect and standard *
. 
. *       errors.                                                         *
. 
. *     ****************************************************************  *
. 
. 
. 
. matrix b=e(b) 

. 
. matrix V=e(V)

. 
.  
. 
. scalar b1=b[1,1] 

. 
. scalar b3=b[1,2]

. 
. scalar b2=b[1,3]

. 
. 
. 
. 
. 
. scalar varb1=V[1,1] 

. 
. scalar varb2=V[3,3] 

. 
. scalar varb3=V[2,2]

. 
. 
. 
. scalar covb1b3=V[1,2] 

. 
. scalar covb2b3=V[3,2]

. 
. 
. 
. scalar list b1 b2 b3 varb1 varb2 varb3 covb1b3 covb2b3
        b1 = -.57668103
        b2 =  2.1047442
        b3 =  .12291845
     varb1 =  .08956532
     varb2 =  .09631819
     varb3 =  .00202663
   covb1b3 = -.01332401
   covb2b3 = -.00309468

. 
. 
. 
. *     ****************************************************************  *
. 
. *       Calculate the marginal effect of X on Y for all MV values of    *
. 
. *       the modifying variable Z.                                       *
. 
. *     ****************************************************************  *
. 
. 
. 
. gen conb=b1+b3*MV if _n<9.57
(12581 missing values generated)

. 
. 
. 
. 
. 
. *     ****************************************************************  *
. 
. *       Calculate the standard errors for the marginal effect of X on Y *
. 
. *       for all MV values of the modifying variable Z.                  *
. 
. *     ****************************************************************  *
. 
. 
. 
. gen conse=sqrt(varb1+varb3*(MV^2)+2*covb1b3*MV) if _n<9.57
(12581 missing values generated)

. 
. 
. 
. 
. 
. *     ****************************************************************  *
. 
. *       Generate upper and lower bounds of the confidence interval.     *
. 
. *       Specify the significance of the confidence interval.            *
. 
. *     ****************************************************************  *
. 
. 
. 
. gen a=1.96*conse
(12581 missing values generated)

. 
.  
. 
. gen upper=conb+a
(12581 missing values generated)

. 
.  
. 
. gen lower=conb-a
(12581 missing values generated)

. 
. 
. 
. *     ****************************************************************  *
. 
. *       Graph the marginal effect of X on Y across the desired range of *
. 
. *       the modifying variable Z.  Show the confidence interval.        *
. 
. *     ****************************************************************  *
. 
. 
. 
. graph twoway line conb MV,  clwidth(medium) clcolor(blue) clcolor(black) || line
>  upper  MV, clpattern(dash) clwidth(thin) clcolor(black) ||line lower  MV, clpat
> tern(dash) clwidth(thin) clcolor(black) || ,  yscale(noline) xscale(noline) lege
> nd(col(1) order(1 2) label(1 "Marginal Effect of Jewish Community") label(2 "95%
>  Confidence Interval") label(3 " ")) yline(0, lcolor(black)) title("", size(3)) 
> subtitle(" " "DID Effect of Jewish Community on Log City Size as Market Access I
> ncreases" " ", size(3)) xtitle( "Market Access", size(3)  ) xsca(titlegap(2)) ys
> ca(titlegap(2)) ytitle("Marginal Effect of Jewish Community", size(3)) scheme(s2
> mono) graphregion(fcolor(white))

. 
. 
. drop  MV conb conse a upper lower

. 
. 
. 
. 
. 
. 
. 
. 
. 
. 
. ******************************************************************
. * Figure A.7: interaction plot for market access and jewish community IV
. ******************************************************************
. 
. 
. xi: quietly: xtivreg2 lpop (jewspresentDummy JewsDummyXIV_MA = lnIV100k lnIV100k
> _JewsDummyXIV_MA ) lnIV_MA  i.year i.year*cereal50k i.year*university  i.year*DR
> R i.year*DAnySeas i.year*DRivers i.year*DMedRds if JewishCity==1 & year>1300,  f
> e robust
i.year            _Iyear_1400-1850    (naturally coded; _Iyear_1400 omitted)
i.year*cere~50k   _IyeaXcer_#         (coded as above)
i.year*univer~y   _IyeaXuni_#         (coded as above)
i.year*DRR        _IyeaXDRR_#         (coded as above)
i.year*DAnySeas   _IyeaXDAn_#         (coded as above)
i.year*DRivers    _IyeaXDRi_#         (coded as above)
i.year*DMedRds    _IyeaXDMe_#         (coded as above)

. 
. *************************************
. 
. generate MV=(_n)

. 
. 
. 
. replace  MV=. if _n>9.57
(12577 real changes made, 12577 to missing)

. replace  MV=. if _n<4.85
(4 real changes made, 4 to missing)

. 
. 
. *     ****************************************************************  *
. 
. *       Grab elements of the coefficient and variance-covariance matrix *
. 
. *       that are required to calculate the marginal effect and standard *
. 
. *       errors.                                                         *
. 
. *     ****************************************************************  *
. 
. 
. 
. matrix b=e(b) 

. 
. matrix V=e(V)

. 
.  
. 
. scalar b1=b[1,1] 

. 
. scalar b3=b[1,2]

. 
. scalar b2=b[1,3]

. 
. 
. 
. 
. 
. scalar varb1=V[1,1] 

. 
. scalar varb2=V[3,3] 

. 
. scalar varb3=V[2,2]

. 
. 
. 
. scalar covb1b3=V[1,2] 

. 
. scalar covb2b3=V[3,2]

. 
. 
. 
. scalar list b1 b2 b3 varb1 varb2 varb3 covb1b3 covb2b3
        b1 = -3.5232904
        b2 =  2.0122036
        b3 =  .54221135
     varb1 =  .42838983
     varb2 =  .08631716
     varb3 =  .00943269
   covb1b3 = -.06288775
   covb2b3 = -.00915332

. 
. 
. 
. *     ****************************************************************  *
. 
. *       Calculate the marginal effect of X on Y for all MV values of    *
. 
. *       the modifying variable Z.                                       *
. 
. *     ****************************************************************  *
. 
. 
. 
. gen conb=b1+b3*MV if _n<9.57
(12581 missing values generated)

. 
. 
. 
. 
. 
. *     ****************************************************************  *
. 
. *       Calculate the standard errors for the marginal effect of X on Y *
. 
. *       for all MV values of the modifying variable Z.                  *
. 
. *     ****************************************************************  *
. 
. 
. 
. gen conse=sqrt(varb1+varb3*(MV^2)+2*covb1b3*MV) if _n<9.57
(12581 missing values generated)

. 
. 
. 
. 
. 
. *     ****************************************************************  *
. 
. *       Generate upper and lower bounds of the confidence interval.     *
. 
. *       Specify the significance of the confidence interval.            *
. 
. *     ****************************************************************  *
. 
. 
. 
. gen a=1.96*conse
(12581 missing values generated)

. 
.  
. 
. gen upper=conb+a
(12581 missing values generated)

. 
.  
. 
. gen lower=conb-a
(12581 missing values generated)

. 
. 
. 
. *     ****************************************************************  *
. 
. *       Graph the marginal effect of X on Y across the desired range of *
. 
. *       the modifying variable Z.  Show the confidence interval.        *
. 
. *     ****************************************************************  *
. 
. 
. 
. graph twoway line conb MV,  clwidth(medium) clcolor(blue) clcolor(black) || line
>  upper  MV, clpattern(dash) clwidth(thin) clcolor(black) ||line lower  MV, clpat
> tern(dash) clwidth(thin) clcolor(black) || ,  yscale(noline) xscale(noline) lege
> nd(col(1) order(1 2) label(1 "Marginal Effect of Jewish Community") label(2 "95%
>  Confidence Interval") label(3 " ")) yline(0, lcolor(black)) title("", size(3)) 
> subtitle(" " "DID Effect of Jewish Community on Log City Size as Market Access I
> ncreases" " ", size(3)) xtitle( "Market Access", size(3)  ) xsca(titlegap(2)) ys
> ca(titlegap(2)) ytitle("Marginal Effect of Jewish Community", size(3)) scheme(s2
> mono) graphregion(fcolor(white))

. 
. 
. drop  MV conb conse a upper lower

. 
. 
. 
. 
. 
. 
. log close
      name:  <unnamed>
       log:  /Users/Noel Johnson Notebook/Desktop/Dropbox/Research/Jews City Growt
> h/Replication Files JDE Johnson_Koyama/Jews City Growth Analysis Final.log
  log type:  text
 closed on:  30 Aug 2016, 21:01:42
----------------------------------------------------------------------------------
